STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_rcc.c
  * @author  MCD Application Team
  * @TODO:   Re-write this brief
  * @brief   RCC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Reset and Clock Control (RCC) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *
  @verbatim
  ==============================================================================
                      ##### RCC specific features #####
  ==============================================================================
    [..]
      After reset the device is running from Internal High Speed oscillator
      (HSI 64MHz) with Flash 0 wait state,and all peripherals are off except
      internal SRAM, Flash, JTAG and PWR
      (+) There is no pre-scaler on High speed (AHB) and Low speed (APB) buses;
          all peripherals mapped on these buses are running at HSI speed.
      (+) The clock for all peripherals is switched off, except the SRAM and FLASH.
      (+) All GPIOs are in analogue mode , except the JTAG pins which
          are assigned to be used for debug purpose.

    [..]
      Once the device started from reset, the user application has to:
      (+) Configure the clock source to be used to drive the System clock
          (if the application needs higher frequency/performance)
      (+) Configure the System clock frequency and Flash settings
      (+) Configure the AHB and APB buses pre-scalers
      (+) Enable the clock for the peripheral(s) to be used
      (+) Configure the clock kernel source(s) for peripherals which clocks are not
          derived from the System clock through :RCC_D1CCIPR,RCC_D2CCIP1R,RCC_D2CCIP2R
          and RCC_D3CCIPR registers

                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
      (+) If peripheral is mapped on AHB: the delay is 2 AHB clock cycle
          after the clock enable bit is set on the hardware register
      (+) If peripheral is mapped on APB: the delay is 2 APB clock cycle
          after the clock enable bit is set on the hardware register

    [..]
      Implemented Workaround:
      (+) For AHB & APB peripherals, a dummy read to the peripheral register has been
          inserted in each __HAL_RCC_PPP_CLK_ENABLE() macro.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2021 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#if 0 // 191021
/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"
#include "stm32mp2xx_hal_rcc_valid.h"
#include <stdio.h>

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup RCC RCC
  * @brief RCC HAL module driver
  * @{
  */

#ifdef HAL_RCC_VALID_MODULE_ENABLED

/* Additional macros for register access by address */
#ifndef SET_BITA
#define SET_BITA(ADDR, BIT)     (*(uint32_t*)(ADDR) |= (BIT))
#endif
#ifndef CLEAR_BITA
#define CLEAR_BITA(ADDR, BIT)   (*(uint32_t*)(ADDR) &= ~(BIT))
#endif
#ifndef READ_BITA
#define READ_BITA(ADDR, BIT)    (*(uint32_t*)(ADDR) & (BIT))
#endif
#ifndef CLEAR_REGA
#define CLEAR_REGA(ADDR)        (*(uint32_t*)(ADDR) = (0x0))
#endif
#ifndef WRITE_REGA
#define WRITE_REGA(ADDR,VAL)    (*(uint32_t*)(ADDR) = (VAL))
#endif
#ifndef READ_REGA
#define READ_REGA(ADDR)         (*(uint32_t*)(ADDR))
#endif
#ifndef MODIFY_REGA
#define MODIFY_REGA(ADDR, CLEARMASK, SETMASK)  WRITE_REGA((ADDR), (((READ_REGA(ADDR)) & (~(CLEARMASK))) | (SETMASK)))
#endif

/** @defgroup RCC_Private_Function_Prototypes RCC Private Functions Prototypes
  * @{
  */

/**
  * @}
  */

/* The following functions are useable from validation code but non-official */

/* Wait until '*addr & mask' == 'val'.
   Return: HAL_OK or HAL_TIMEOUT */
int RCC_Wait(volatile void *addr, uint32_t mask, uint32_t val, uint32_t timeout)
{
  uint32_t tickstart;
  tickstart = HAL_GetTick();
  while ((READ_REGA(addr) & mask) != val)
  {
    if ((uint32_t)(HAL_GetTick() - tickstart) > timeout)
    {
      return HAL_TIMEOUT;
    }
  }
  return HAL_OK;
}

/* Change BDCR write protection
   enable: 1=BDCR write protected, 0=can be modified */
void RCC_XableProtection(int enable)
{
  /* DBD3P bit in PWR->BDCR1 reg */
  if (enable)
  {
    CLEAR_BIT(PWR->BDCR1, 1 << 0);
  }
  else
    SET_BIT(PWR->BDCR1, 1 << 0);
}

