STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
/******************************************************************************
  * Flexiclockgen management
  * This part is designed to be a generic flexgen library.
  * Informations just below allow to make the link with real SOC.
  ******************************************************************************/

typedef struct
{
  uint16_t *ref_table;    // refclk = muxsel inputs
  uint16_t ref_size;      // Nb of muxsel inputs
  uint16_t *src_table;    // srcclk
  uint16_t src_size;      // Nb of srcclk inputs
  uint16_t *msout_table;  // Muxsel outputs
  uint16_t msout_size;    // Nb of muxsel outputs
  uint16_t *gout_table;   // GFG outputs
  uint16_t gout_size;     // Nb of GFG outputs
  uint16_t fdiv_first;    // Final div first clock ID (channel 0)
  uint16_t fdiv_last;     // Final div last clock ID
  uint16_t *cbar_table;   // Crossbar inputs
  uint16_t cbar_size;     // Nb of crossbar inputs
} RCC_FlexgenTypeDef;

/*
  * Start of SOC adaptation part
  */

/* Refclk (muxsel inputs) clocks mapping (index order) */
uint16_t RCC_FG_MuxselInTable[] =
{
  RCC_CK_HSI, // Index 0
  RCC_CK_HSE,
  RCC_CK_CSI,
  RCC_CK_LSI,
  RCC_CK_LSE,
};

/* Src clocks mapping (index order) */
uint16_t RCC_FG_SrcInTable[] =
{
  RCC_CK_HSI_KER,
  RCC_CK_HSE_KER,
  RCC_CK_CSI_KER,
  RCC_CK_SPDIF,
  RCC_CK_I2S,
  RCC_CK_LSI,
  RCC_CK_LSE,
};

/* Muxsel outputs clocks mapping */
uint16_t RCC_FG_MuxselOutTable[] =
{
  RCC_CK_PLL4REF, // Index 0 => GFG0/PLL4
  RCC_CK_PLL5REF,
  RCC_CK_PLL6REF,
  RCC_CK_PLL7REF,
  RCC_CK_PLL8REF, // Index 4 = > GFG4/PLL8
  RCC_CK_PLL1REF, // Index 5 => to flexgen external
  RCC_CK_PLL2REF,
  RCC_CK_PLL3REF,
};

/* GFG output clocks */
uint16_t RCC_FG_GFGOutTable[] =
{
  RCC_CK_PLL4, // Index 0 => GFG0/PLL4
  RCC_CK_PLL5,
  RCC_CK_PLL6,
  RCC_CK_PLL7,
  RCC_CK_PLL8, // Index 4 = > GFG4/PLL8
};

/* Cross bar inputs clocks mapping (index order) */
uint16_t RCC_FG_CrossbarInTable[] =
{
  RCC_CK_PLL4, // Index 0
  RCC_CK_PLL5,
  RCC_CK_PLL6,
  RCC_CK_PLL7,
  RCC_CK_PLL8,
  RCC_CK_HSI,
  RCC_CK_HSE,
  RCC_CK_CSI,
  RCC_CK_HSI_KER,
  RCC_CK_HSE_KER,
  RCC_CK_CSI_KER,
  RCC_CK_SPDIF,
  RCC_CK_I2S,
  RCC_CK_LSI,
  RCC_CK_LSE,
};

RCC_FlexgenTypeDef RCC_Flexgen =
{
  .ref_table = RCC_FG_MuxselInTable,
  .ref_size = sizeof(RCC_FG_MuxselInTable) / sizeof(uint16_t),
  .src_table = RCC_FG_SrcInTable,
  .src_size = sizeof(RCC_FG_SrcInTable) / sizeof(uint16_t),
  .msout_table = RCC_FG_MuxselOutTable,
  .msout_size = sizeof(RCC_FG_MuxselOutTable) / sizeof(uint16_t),
  .gout_table = RCC_FG_GFGOutTable,
  .gout_size = sizeof(RCC_FG_GFGOutTable) / sizeof(uint16_t),
  .cbar_table = RCC_FG_CrossbarInTable,
  .cbar_size = sizeof(RCC_FG_CrossbarInTable) / sizeof(uint16_t),
  .fdiv_first = RCC_CK_ICN_MCU,
  .fdiv_last = RCC_CK_CPU1EXT2F,
};

/*
 * End of SOC adapation part.
 * Rest of the code hereafter is generic.
 */

/* Check if 'clk_id' is handled by flexgen
   Returns: Clock index if found, or -1 if not found */
int RCC_FG_GetClockIdx(uint16_t clk_id, uint16_t *table, uint16_t size)
{
  int table_size = size;
  int idx;
  for (idx = 0; idx < table_size; idx++)
    if (table[idx] == clk_id) { break; }
  if (idx == table_size)
  {
    return -1;  // Invalid source
  }
  return idx;
}

/* Switch crossbar for given channel (xbar_idx).
   In case of timeout, previous switch value is restored to not let
   crossbar in a bad state.
   WARNING: Previous source must be ON to allow switch completion.
     With current RCC reset limitations only power ON may restore
     a clean state.
   Returns: 0=OK, -1=ERROR/timeout */
int RCC_FG_SetCrossbar(int xbar_idx, int xbar_in)
{
  if ((READ_REG(RCC->XBARxCFGR[xbar_idx]) & 0xf) == xbar_in)
  {
    return 0;  // Already set
  }

  uint32_t timeout = 1; // Few cycles of slowest clock (32K). 1ms is far enough
  uint32_t tickstart;

  /* Checking crossbar status first */
  for (tickstart = HAL_GetTick();
       (READ_REG(RCC->XBARxCFGR[xbar_idx]) & (1 << 7)) && ((int32_t)(HAL_GetTick() - tickstart) < timeout););
  if (READ_REG(RCC->XBARxCFGR[xbar_idx]) & (1 << 7))
  {
    return -1; // Timeout
  }

  /* Configuring + enable */
  uint32_t saved = READ_REG(RCC->XBARxCFGR[xbar_idx]);
  WRITE_REG(RCC->XBARxCFGR[xbar_idx], (1 << 6) | xbar_in);

  /* Waiting switch completion */
  for (tickstart = HAL_GetTick();
       (READ_REG(RCC->XBARxCFGR[xbar_idx]) & (1 << 7)) && ((int32_t)(HAL_GetTick() - tickstart) < timeout););
  if (READ_REG(RCC->XBARxCFGR[xbar_idx]) & (1 << 7))
  {
    /* Extending timeout */
    for (tickstart = HAL_GetTick();
         (READ_REG(RCC->XBARxCFGR[xbar_idx]) & (1 << 7)) && ((int32_t)(HAL_GetTick() - tickstart) < (timeout * 10)););
    if ((READ_REG(RCC->XBARxCFGR[xbar_idx]) & (1 << 7)) == 0)
    {
      return 0; // Finally OK => probably wrong tick programmation
    }
    /* END Extending timeout */
    WRITE_REG(RCC->XBARxCFGR[xbar_idx], saved); // Restoring to not let unstable status
    return -1; // Timeout
  }

  return 0;
}

/* Description: Read XBAR or MUXEL config to identify source clock
     clk_id = output clock
     src_id = input clock
   Returns: 0=OK, -1=ERROR */
int RCC_FG_GetSource(uint32_t clk_id, uint32_t *src_id)
{
  if (!clk_id || !src_id)
  {
    printf("<E> RCC_FG_GetSource : invalid args clk_id/src_id = %u/0x%08lX\n\r", clk_id, (uint32_t)src_id);
    return -1; // Invalid args
  }

  /* 'clk_id' = PLL ref clock ? */
  /* TODO: This part should be removed, except for PLL1..3 */
  int clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.msout_table, RCC_Flexgen.msout_size);
  if (clk_idx != -1)
  {
    int src_idx;
    src_idx = (READ_REG(RCC->MUXSELCFGR) >> (4 * clk_idx)) & 0x3;
    if (src_idx >= RCC_Flexgen.ref_size)
    {
      printf("<E> RCC_FG_GetSource : invalid src_idx %u (vs %u)\n\r", src_idx, RCC_Flexgen.ref_size);
      return -1;
    }
    *src_id = RCC_Flexgen.ref_table[src_idx];
    return 0;
  }

  /* 'clk_id' = PLL output clock ? */
  clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.gout_table, RCC_Flexgen.gout_size);
  if (clk_idx != -1)
  {
    int src_idx;
    src_idx = (READ_REG(RCC->MUXSELCFGR) >> (4 * clk_idx)) & 0x3;
    if (src_idx >= RCC_Flexgen.ref_size)
    {
      printf("<E> RCC_FG_GetSource : invalid src_idx %u (vs %u)\n\r", src_idx, RCC_Flexgen.ref_size);
      return -1;
    }
    *src_id = RCC_Flexgen.ref_table[src_idx];
    return 0;
  }

