STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
  /* Final div clock ? */
  if ((clk_id >= RCC_Flexgen.fdiv_first) && (clk_id <= RCC_Flexgen.fdiv_last))
  {
    /* Computing fdiv channel number */
    int clk_idx = clk_id - RCC_Flexgen.fdiv_first;

    /* Reading xbar config */
    int src_idx = READ_REG(RCC->XBARxCFGR[clk_idx]) & 0xf;

    /* Identifying connected clock */
    if (src_idx >= RCC_Flexgen.cbar_size)
    {
      printf("<E> RCC_FG_GetSource : invalid src_idx %u (vs %u)\n\r", src_idx, RCC_Flexgen.cbar_size);
      return -1;
    }
    *src_id = RCC_Flexgen.cbar_table[src_idx];
    return 0;
  }
  printf("<E> RCC_FG_GetSource : Neither a MUXSEL output nor a FDIV output\n\r");
  return -1; // Neither a MUXSEL output nor a FDIV output
}

/* Description: Configure MUXSEL or XBAR
     clk_id = output clock ID
     src_id  = input clock ID
   Note: Not static since directly used by valid SW. Maybe useful to create an official
         "HAL_RCC_SetSource(clk_id, src_id)"
   Returns:     0=OK, -1=ERROR */
int RCC_FG_SetSource(uint32_t clk_id, uint32_t src_id)
{
  if (!clk_id || (clk_id >= RCC_CK_LAST))
  {
    printf("<E> RCC_FG_SetSource : invalid clock %u (vs %u)\n\r", clk_id, RCC_CK_LAST);
    return -1; // Invalid clock
  }
  if (!src_id || (src_id >= RCC_CK_LAST))
  {
    printf("<E> RCC_FG_SetSource : invalid source %u (vs %u)\n\r", src_id, RCC_CK_LAST);
    return -1; // Invalid source clock
  }

  /* 'clk_id' = final div output clock ? */
  if ((clk_id >= RCC_Flexgen.fdiv_first) && (clk_id <= RCC_Flexgen.fdiv_last))
  {

    /* Computing xbar input */
    int in_idx;
    in_idx = RCC_FG_GetClockIdx(src_id, RCC_Flexgen.cbar_table, RCC_Flexgen.cbar_size);
    if (in_idx == -1)
    {
      printf("<E> RCC_FG_SetSource : invalid source of final div output clock\n\r");
      return -1; // Invalid source
    }

    /* Configuring crossbar */
    int out_idx = clk_id - RCC_Flexgen.fdiv_first;
    if (RCC_FG_SetCrossbar(out_idx, in_idx) != 0)
    {
      printf("<E> RCC_FG_SetSource : invalid crossbar config\n\r");
      return -1;
    }
    return 0;
  }

  /* 'clk_id' = GFG ref clock ? */
  int out_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.msout_table, RCC_Flexgen.msout_size);
  if (out_idx != -1)
  {
    /* Computing muxsel input */
    int in_idx;
    in_idx = RCC_FG_GetClockIdx(src_id, RCC_Flexgen.ref_table, RCC_Flexgen.ref_size);
    if (in_idx == -1)
    {
      printf("<E> RCC_FG_SetSource : invalid source of GFG ref clock\n\r");
      return -1; // Invalid source
    }

    uint32_t val;
    val = READ_REG(RCC->MUXSELCFGR) & ~(0x3 << (4 * out_idx));
    WRITE_REG(RCC->MUXSELCFGR, val | (in_idx << (4 * out_idx)));
    return 0;
  }

  /* 'clk_id' = observation clock ? */
  if ((clk_id == RCC_CK_OBS0) || (clk_id == RCC_CK_OBS1))
  {
    /* TODO: To be completed */
  }

  printf("<E> RCC_FG_SetSource : Unexpected clock\n\r");
  return -1; // Unexpected clock
}

/* Description: Get programmed divider (prediv + final div)
   Returns:     0=OK, -1=ERROR */
int RCC_FG_GetDiv(uint32_t clk_id, uint32_t *div)
{
  uint32_t pdiv, fdiv;
  int channel;

  if (!clk_id || (clk_id >= RCC_CK_LAST))
  {
    return -1;  // Invalid clock
  }
  if ((clk_id < RCC_Flexgen.fdiv_first) || (clk_id > RCC_Flexgen.fdiv_last))
  {
    return -1;  // Not a final div output
  }

  channel = clk_id - RCC_Flexgen.fdiv_first;

  /* Get pre-divider value */
  switch (READ_REG(RCC->PREDIVxCFGR[channel]) & RCC_PREDIVxCFGR_PREDIVx_Msk)
  {
    case 0:
      pdiv = 1;
      break;
    case 1:
      pdiv = 2;
      break;
    case 3:
      pdiv = 4;
      break;
    default:
      pdiv = 1024;
      break;
  }

  /* Get final divider */
  fdiv = (READ_REG(RCC->FINDIVxCFGR[channel]) & 0x3f) + 1;

  /* Compute divider */
  *div = pdiv * fdiv;

  return 0;
}

/* Description: Set pre and/or final divider ratios
   Note: In case of div config failed, previous div restored.
   Returns:     0=OK, -1=ERROR/timeout */
int RCC_FG_SetDiv(uint32_t clk_id, uint32_t div)
{
  uint32_t pdiv, fdiv;
  int channel;

  if (!clk_id || (clk_id >= RCC_CK_LAST))
  {
    return -1;  // Invalid clock
  }
  if ((clk_id < RCC_Flexgen.fdiv_first) || (clk_id > RCC_Flexgen.fdiv_last))
  {
    return -1;  // Not a final div output
  }

  channel = clk_id - RCC_Flexgen.fdiv_first;

  /* Computing predivider & final divider ratios.
     Reminder: pre div can only take values 1, 2, 4 or 1024 (coded 0, 1, 3, or 0x3FF)
               final div can take values 1 to 64 (coded 0 to 0x3F) */
  /* TBC : Exclude div invalid zero value */
  /* TBC : Exclude div odd values impossible to set */
  /* TBC : Exclude div value greater than 64*1024 = 65536 */

  if (div <= 64)
  {
    pdiv = 0x0;      /* "div1" */
    fdiv = div - 1;  /* "div"  */
  }
  else if (div <= 128)
  {
    pdiv = 0x1;      /* "div2"  */
    fdiv = (div / 2) - 1;
  }
  else if (div <= 256)
  {
    pdiv = 0x3;      /* "div4"  */
    fdiv = (div / 4) - 1;
  }
  else
  {
    pdiv = 0x3FF;    /* "div1024" */
    fdiv = (div / 1024) - 1;
  }

  volatile uint32_t *st_addr; // Status reg address
  int st_bit; // Status bit for PREDIVxCFGR & FINDIVxCFGR
  if (channel < 32)
  {
    st_bit = channel;
  }
  else
    st_bit = channel - 32;
  uint32_t saved;
  uint32_t tickstart;
#if defined (USE_STM32MP257CXX_EMU)
  uint32_t timeout = 2; // TO BE CONFIRMED (means ]1;2] ticks, latency included)
#elif defined (USE_STM32MP257CXX_FPGA)
  uint32_t timeout = 8; // TO BE CONFIRMED (means ]7;8] ticks, latency included)
#else
  uint32_t timeout = 2; // TO BE CONFIRMED (means ]1;2] ticks, latency included)
#endif /* defined (USE_STM32MP257CXX_EMU) | defined (USE_STM32MP257CXX_FPGA) */
  /* Pre-divider config if required */
  if ((READ_REG(RCC->PREDIVxCFGR[channel]) & 0x3ff) != pdiv)
  {
    if (channel < 32)
    {
      st_addr = &(RCC->PREDIVSR1);
    }
    else
      st_addr = &(RCC->PREDIVSR2);

    /* Check for completion of prediv current value */
    for (tickstart = HAL_GetTick(); (*st_addr & (1 << st_bit)) && (HAL_GetTick() - tickstart < timeout););
    if (*st_addr & (1 << st_bit))
    {
      printf("RCC_FG_SetDiv ERROR : PREDIV not READY (@0x%08lX = 0x%08lX) for channel %d\n",
             (uint32_t)st_addr, *st_addr, channel);
      return -1; // Timeout
    }
    saved = READ_REG(RCC->PREDIVxCFGR[channel]);
    WRITE_REG(RCC->PREDIVxCFGR[channel], pdiv);

    /* Wait for completion of prediv change */
    for (tickstart = HAL_GetTick(); (*st_addr & (1 << st_bit)) && (HAL_GetTick() - tickstart < timeout););
    if (*st_addr & (1 << st_bit))
    {
      printf("RCC_FG_SetDiv ERROR : PREDIV not CHANGED (@0x%08lX = 0x%08lX) for channel %d\n",
             (uint32_t)st_addr, *st_addr, channel);
      WRITE_REG(RCC->PREDIVxCFGR[channel], saved); // Restoring previous

      /* Wait for completion of prediv restoration */
      for (tickstart = HAL_GetTick(); (*st_addr & (1 << st_bit)) && (HAL_GetTick() - tickstart < timeout););
      if (*st_addr & (1 << st_bit))
      {
        printf("RCC_FG_SetDiv ERROR : PREDIV not RESTORED (@0x%08lX = 0x%08lX) for channel %d\n",
               (uint32_t)st_addr, *st_addr, channel);
      }
      return -1; // Timeout
    }
  }

  /* Final divider config if required */
  if ((READ_REG(RCC->FINDIVxCFGR[channel]) & 0x3f) != fdiv)
  {
    if (channel < 32)
    {
      st_addr = &(RCC->FINDIVSR1);
    }
    else
      st_addr = &(RCC->FINDIVSR2);

    /* Check for completion of findiv current value */
    for (tickstart = HAL_GetTick(); (*st_addr & (1 << st_bit)) && (HAL_GetTick() - tickstart < timeout););
    if (*st_addr & (1 << st_bit))
    {
      printf("RCC_FG_SetDiv ERROR : FINDIV not READY (@0x%08lX = 0x%08lX) for channel %d\n",
             (uint32_t)st_addr, *st_addr, channel);
      return -1; // Timeout
    }

