STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
    saved = READ_REG(RCC->FINDIVxCFGR[channel]);
    uint32_t findiven;
    findiven = saved & (1 << 6); // Get enable status
    WRITE_REG(RCC->FINDIVxCFGR[channel], findiven | fdiv); // Xable + final div

    /* Wait for completion of findiv change */
    for (tickstart = HAL_GetTick(); (*st_addr & (1 << st_bit)) && (HAL_GetTick() - tickstart < timeout););
    if (*st_addr & (1 << st_bit))
    {
      printf("RCC_FG_SetDiv ERROR : FINDIV not CHANGED (@0x%08lX = 0x%08lX) for channel %d\n",
             (uint32_t)st_addr, *st_addr, channel);
      WRITE_REG(RCC->FINDIVxCFGR[channel], saved); // Restoring previous

      /* Wait for completion of findiv restoration */
      for (tickstart = HAL_GetTick(); (*st_addr & (1 << st_bit)) && (HAL_GetTick() - tickstart < timeout););
      if (*st_addr & (1 << st_bit))
      {
        printf("RCC_FG_SetDiv ERROR : FINDIV not RESTORED (@0x%08lX = 0x%08lX) for channel %d\r\n",
               (uint32_t)st_addr, *st_addr, channel);
      }
      return -1; // Timeout
    }
  }
  return 0;
}

/* Read GFG0 to 4 (PLL4 to 8) config
   Returns: 0=OK, -1=ERROR */
static int RCC_FG_GetGFG(RCC_PLLCfgTypeDef *pll)
{
  assert_param(pll != NULL);
  assert_param(pll->id != RCC_CK_NONE);
  assert_param(pll->id < RCC_CK_LAST);

  /* Source identification.
     REMINDER: PLL is statically connected to xxREF. PLL source identification
               must therefore be done on xxREF clock */
  uint16_t ref_id; // PLL ref clock (RCC_CK_PLLxREF)
  ref_id = RCC_CK_PLL4REF + (pll->id - RCC_CK_PLL4);
  if (RCC_FG_GetSource(ref_id, &pll->source) != 0)
  {
    return -1;
  }

  /* Computing proper config registers addresses */
  uint32_t x;
  void *cfgr1, *cfgr2, *cfgr3, *cfgr4, *cfgr5, *cfgr6, *cfgr7;
  x = pll->id - RCC_Flexgen.gout_table[0];
  cfgr1 = (void *)&RCC->PLL4CFGR1 + (0x28 * x);
  cfgr2 = (void *)&RCC->PLL4CFGR2 + (0x28 * x);
  cfgr3 = (void *)&RCC->PLL4CFGR3 + (0x28 * x);
  cfgr4 = (void *)&RCC->PLL4CFGR4 + (0x28 * x);
  cfgr5 = (void *)&RCC->PLL4CFGR5 + (0x28 * x);
  cfgr6 = (void *)&RCC->PLL4CFGR6 + (0x28 * x);
  cfgr7 = (void *)&RCC->PLL4CFGR7 + (0x28 * x);

  uint32_t val;

  /* State ?
     Note: ON means enabled (PLLEN) and ready (PLLRDY)
     Note: Bypass state does not reflect PLL state (may be ON or OFF but unused) */
  pll->state = 0;
  val = READ_REGA(cfgr4);
  if (val & (1 << 10)) // Bypassed ?
  {
    pll->state |= RCC_PLLSTATE_BYPASS;
  }
  val = READ_REGA(cfgr1);
  if ((val & (1 << 8)) && (val & (1 << 24))) // PLLEN=1 + PLLRDY=1
  {
    pll->state |= RCC_PLLSTATE_ON;
  }
  else
    pll->state |= RCC_PLLSTATE_OFF;

  pll->flags = 0; // Integer, DAC disabled, SSCG disabled, SSCG center

  val = READ_REGA(cfgr2);
  pll->frefdiv = (val >> 0) & 0x3f;
  pll->fbdiv = (val >> 16) & 0xfff;

  /* Frac or integer ? */
  val = READ_REGA(cfgr4);
  if (val & (1 << 8)) // DSMEN
  {
    pll->flags |= RCC_PLLFLAG_FRACTIONAL;
  }
  val = READ_REGA(cfgr3);
  pll->frac_in = val & 0xffffff;
  if (val & (1 << 25))
  {
    pll->flags |= RCC_PLLFLAG_DAC_ON;
  }

  /* SSCG status */
  val = READ_REGA(cfgr5);
  pll->sscg_moddepth = (val >> 16) & 0x1f; // Modulation depth
  pll->sscg_modfreq = (val >> 0) & 0xf; // Modulation freq
  val = READ_REGA(cfgr3);
  if (val & (1 << 24)) // DOWNSPREAD
  {
    pll->flags |= RCC_PLLFLAG_SSCG_DOWN;
  }
  if ((val & (1 << 26)) == 0) // SSCGDIS
  {
    pll->flags |= RCC_PLLFLAG_SSCG_ON;
  }

  /* Output status */
  val = READ_REGA(cfgr4);
  if (val & (1 << 9))   // FOUTPOSTDIVEN
  {
    pll->postdiv1 = READ_REGA(cfgr6) & 0x7;
    pll->postdiv2 = READ_REGA(cfgr7) & 0x7;
  }
  else
  {
    /* Fout postdiv disabled => resulting div = 1 */
    pll->postdiv1 = 1;
    pll->postdiv2 = 1;
  }

  return 0;
}

/* Description: Configure GFG (PLL or FS)
                WARNING: This function uses bypass if available but if not
                it assumes PLL/FS is free to be reprogrammed (not in use).
   Returns:     0=OK, -1=ERROR */
static int RCC_FG_SetGFG(RCC_PLLCfgTypeDef *pll)
{
  assert_param(pll != NULL);
  assert_param(pll->id != RCC_CK_NONE);
  assert_param(pll->id < RCC_CK_LAST);
  assert_param(pll->source != RCC_CK_NONE);
  assert_param(pll->source < RCC_CK_LAST);

  /* Checking PLL clock */
  int clk_idx;
  clk_idx = RCC_FG_GetClockIdx(pll->id, RCC_Flexgen.gout_table, RCC_Flexgen.gout_size);
  if (clk_idx == -1)
  {
    return -1;  // Invalid PLL
  }

  /* Checking PLL source clock.
     It can only be one of the MUXSEL inputs (refclk) */
  int src_idx;
  src_idx = RCC_FG_GetClockIdx(pll->source, RCC_Flexgen.ref_table, RCC_Flexgen.ref_size);
  if (src_idx == -1)
  {
    return -1;  // Invalid source
  }

  void *cfgr1, *cfgr2, *cfgr3, *cfgr4, *cfgr5, *cfgr6, *cfgr7;
  cfgr1 = (void *)&RCC->PLL4CFGR1 + (0x28 * clk_idx);
  cfgr2 = (void *)&RCC->PLL4CFGR2 + (0x28 * clk_idx);
  cfgr3 = (void *)&RCC->PLL4CFGR3 + (0x28 * clk_idx);
  cfgr4 = (void *)&RCC->PLL4CFGR4 + (0x28 * clk_idx);
  cfgr5 = (void *)&RCC->PLL4CFGR5 + (0x28 * clk_idx);
  cfgr6 = (void *)&RCC->PLL4CFGR6 + (0x28 * clk_idx);
  cfgr7 = (void *)&RCC->PLL4CFGR7 + (0x28 * clk_idx);
  uint32_t src_id; // PLL source clock ID
  src_id = RCC_CK_PLL4REF + (pll->id - RCC_CK_PLL4); // TODO: Make it generic

  /* PLLTS16FFCLAFRAC2 only so far */

  /* PLLTS16FFCLAFRAC2 setup order:
     - Set bypass (supported by PLL1 ?)
     - Disable postdiv (supported by PLL1 ?) then VCO
     - Select source
     - Configure PLL
     - Enable PLL if RCC_PLLSTATE_ON
     - Remove bypass if NOT RCC_PLLSTATE_BYPASS (supported by PLL1 ?)
   */

  /* Check FREF
     Must be running and in good range */
  /* TODO */

  /* [TEMPORARY ?] */
  /* When PLL OFF command is selected, just do it */
  /* This avoids "<E> PLL<y>RDY not cleared" issue on FPGA platform */
  /* when running application on A35 */
  if (pll->state & RCC_PLLSTATE_OFF)
  {
    /* Disable PLL */
    CLEAR_BITA(cfgr1, 1 << 8);

    /* Wait for unlock */
    if (RCC_Wait(cfgr1, 1 << 24, 0, PLL_TIMEOUT_VALUE) != HAL_OK)
    {
      return -1;
    }
    else
    {
      /* Remove bypass */
      CLEAR_BITA(cfgr4, (1 << 10));
//            return 0;
    }
  }

  /* Bypass, in case PLL is used */
  /* NO MORE USE IT ON FPGA, BECAUSE IT LEADS TO MALFUNCTION */
  //SET_BITA(cfgr4, (1 << 10));
  /* Disable post div then PLL */
  /* COMMENTED BECAUSE UNUSEFUL */
  //CLEAR_BITA(cfgr4, 1 << 9); // FOUTPOSTDIVEN=0
  //CLEAR_BITA(cfgr1, 1 << 8); // PLLEN=0

  /* Select PLL ref source */
  if (RCC_FG_SetSource(src_id, pll->source) != 0)
  {
    return -1;
  }

  /* Configure PLL */
  uint32_t sscg_dis, dacen, downspread;
  sscg_dis = (pll->flags & RCC_PLLFLAG_SSCG_ON) ? 0 : 1;
  dacen = (pll->flags & RCC_PLLFLAG_DAC_ON) ? 1 : 0;
  downspread = (pll->flags & RCC_PLLFLAG_SSCG_DOWN) ? 1 : 0;
  uint32_t dsmen, postdiven;
  dsmen = (pll->flags & RCC_PLLFLAG_FRACTIONAL) ? 1 : 0;
//    if ((!pll->postdiv1 && !pll->postdiv2) ||
//        ((pll->postdiv1 == 1) && (pll->postdiv2 == 1)))
  if ((!pll->postdiv1 && !pll->postdiv2))
  {
    postdiven = 0;  // FOUTPOSTDIVEN=0
  }
  else
    postdiven = 1; // FOUTPOSTDIVEN=1
  WRITE_REGA(cfgr2, (pll->fbdiv << 16) | pll->frefdiv);
  WRITE_REGA(cfgr3, (sscg_dis << 26) | (dacen << 25) | (downspread << 24) | pll->frac_in);
//    WRITE_REGA(cfgr4, (1 << 10) | (postdiven << 9) | (dsmen << 8)); // Keep bypass + foutpostdiven : NO BYPASS !!!
  WRITE_REGA(cfgr4, (postdiven << 9) | (dsmen << 8)); // Keep foutpostdiven
  WRITE_REGA(cfgr5, (pll->sscg_moddepth << 16) | pll->sscg_modfreq);
  WRITE_REGA(cfgr6, pll->postdiv1); // Postdiv1
  WRITE_REGA(cfgr7, pll->postdiv2); // Postdiv2

  if (pll->state & RCC_PLLSTATE_ON)   // PLL ON
  {
    /* TODO: Could be replaced by call to HAL_RCC_Xable() */
    /* Enable PLL */
    SET_BITA(cfgr1, 1 << 8); // PLLEN
    /* Wait for lock */
    if (RCC_Wait(cfgr1, 1 << 24, 1 << 24, PLL_TIMEOUT_VALUE) != HAL_OK)
    {
      return -1;
    }
  }

  // NO BYPASS
  //if ((pll->state & RCC_PLLSTATE_BYPASS) == 0)
  //    CLEAR_BITA(cfgr4, (1 << 10)); // Remove bypass

