STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
  return 0;
}

/* Description: Enable/disable clocks (PLL or final divider stage)
   Returns:     0=OK, -1=ERROR */
static int RCC_FG_Xable(uint16_t clk_id, int enable)
{
  /* Final divider clock ? */
  if ((clk_id >= RCC_Flexgen.fdiv_first) && (clk_id <= RCC_Flexgen.fdiv_last))
  {
    int channel = clk_id - RCC_Flexgen.fdiv_first;
    uint32_t data;
    if (enable)
    {
      /* Just in case because not supposed to be OFF,
         enabling clock at crossbar stage. */
      data = READ_REG(RCC->XBARxCFGR[channel]);
      WRITE_REG(RCC->XBARxCFGR[channel], data | (1 << 6));

      /* Enabling clock at final divider stage */
      data = READ_REG(RCC->FINDIVxCFGR[channel]);
      WRITE_REG(RCC->FINDIVxCFGR[channel], data | (1 << 6));
    }
    else
    {
      /* Disabling clock at final divider stage */
      data = READ_REG(RCC->FINDIVxCFGR[channel]);
      WRITE_REG(RCC->FINDIVxCFGR[channel], data & ~(1 << 6));
    }
    return 0;
  }

  /* GFG output clock ? */
  int clk_idx;
  clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.gout_table, RCC_Flexgen.gout_size);
  if (clk_idx != -1)
  {
    void *cfgr1;
    cfgr1 = (void *)&RCC->PLL4CFGR1 + (0x28 * clk_idx);
    if (enable)
    {
      SET_BITA(cfgr1, (1 << 8));
    }
    else
      CLEAR_BITA(cfgr1, (1 << 8)); // Set OFF
    return 0;
  }

  return -1; // Not supported
}

/* Get 'enabled' status of GFG (PLLs) or final div outputs.
   Returns: 0=OK, -1=ERROR */
static int RCC_FG_GetStatus(uint16_t clk_id, int *enabled)
{
  /* 'clk_id' == final divider output ? */
  if ((clk_id >= RCC_Flexgen.fdiv_first) && (clk_id <= RCC_Flexgen.fdiv_last))
  {
    int channel = clk_id - RCC_Flexgen.fdiv_first;

    *enabled = 1; // Assuming enabled at both Xbar & Fdiv

    /* Check cross-bar status */
    uint32_t data;
    data = READ_REG(RCC->XBARxCFGR[channel]);
    if ((data & (1 << 6)) == 0)
    {
      *enabled = 0; // Disabled at cross-bar stage
    }
    else
    {
      /* Enabled at cross-bar level.
         Check final divider status */
      data = READ_REG(RCC->FINDIVxCFGR[channel]);
      if ((data & (1 << 6)) == 0)
      {
        *enabled = 0; // Disabled at final divider stage
      }
    }
    return 0;
  }

  /* 'clk_id' == GFG output clock ? */
  int clk_idx;
  clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.gout_table, RCC_Flexgen.gout_size);
  if (clk_idx != -1)
  {
    void *addr = (void *) & (RCC->PLL4CFGR1) + (0x28 * clk_idx); // PLLxCFGR1 addr
    if (READ_REGA(addr) & (1 << 24)) // Check PLL ready flag
    {
      *enabled = 1;
    }
    else
    {
      *enabled = 0;
    }
    return 0;
  }

  return -1; // Invalid clock
}

/* Clock ID to jitter estimator/observation 'ckintsel' field.
   Returns: 0=OK, -1=ERROR */
static int RCC_FG_ID2Ckintsel(uint16_t clk_id, uint32_t *ckintsel)
{
  /* 'clk_id' == Final div output ? */
  if ((clk_id >= RCC_Flexgen.fdiv_first) && (clk_id <= RCC_Flexgen.fdiv_last))
  {
    *ckintsel = (0x3 << 6) | (clk_id - RCC_Flexgen.fdiv_first);
    return 0;
  }

  /* 'clk_id' == ref input clock ? */
  int clk_idx;
  clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.ref_table, RCC_Flexgen.ref_size);
  if (clk_idx != -1)
  {
    *ckintsel = (0x0 << 6) | clk_idx;
    return 0;
  }

  /* 'clk_id' == src input clock ? */
  clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.src_table, RCC_Flexgen.src_size);
  if (clk_idx != -1)
  {
    *ckintsel = (0x2 << 6) | clk_idx;
    return 0;
  }

  /* 'clk_id' == MUXSEL output clock ? */
  clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.msout_table, RCC_Flexgen.msout_size);
  if (clk_idx != -1)
  {
#ifdef APPLY_BZ121873
    *ckintsel = (0x0 << 6) | (clk_idx + RCC_Flexgen.ref_size);
#else
    *ckintsel = (0x0 << 6) | (clk_idx + RCC_Flexgen.ref_size + 2);
#endif /* APPLY_BZ121873 */
    return 0;
  }

  /* 'clk_id' == GFG output clock ? */
  clk_idx = RCC_FG_GetClockIdx(clk_id, RCC_Flexgen.gout_table, RCC_Flexgen.gout_size);
  if (clk_idx != -1)
  {
    *ckintsel = (0x1 << 6) | clk_idx;
    return 0;
  }

  return -1; // Unsupported clock
}

/* Jitter estimator/observation 'ckintsel' field to clock ID.
   Returns: 0=OK, -1=ERROR */
static int RCC_FG_Ckintsel2ID(uint32_t ckintsel, uint16_t *clk_id)
{
  uint32_t shb; // Selection high bits [7:6]
  uint32_t slb; // Selection low bits [5:0]
  shb = ((ckintsel >> 6) & 0x3);
  slb = (ckintsel & 0x3f);

  /* 'clk_id' == Final div output ? */
  if (shb == 0x3)
  {
    *clk_id = RCC_Flexgen.fdiv_first + slb;
    return 0;
  }

  /* 'clk_id' == src input clock ? */
  if (shb == 0x2)
  {
    if (slb >= RCC_Flexgen.src_size)
    {
      return -1;
    }
    *clk_id = RCC_Flexgen.src_table[slb];
    return 0;
  }

  /* 'clk_id' == GFG output clock ? */
  if (shb == 0x1)
  {
    if (slb >= RCC_Flexgen.gout_size)
    {
      return -1;
    }
    *clk_id = RCC_Flexgen.gout_table[slb];
    return 0;
  }

  /* ckintsel[7:6] = 0 => either osc (ref in) or pll ref */
  if (slb < RCC_Flexgen.ref_size)
  {
    *clk_id = RCC_Flexgen.ref_table[slb];
    return 0;
  }
  slb -= (RCC_Flexgen.ref_size + 2);
  if (slb < RCC_Flexgen.msout_size)
  {
    *clk_id = RCC_Flexgen.msout_table[slb];
    return 0;
  }

  return -1; // Unsupported clock
}

/* Perform a HW frequency measurement
   by using embedded "clock frequency calculator"
   according to RCC user spec "Clock frequency calculation" subsection
   'clk_id' = Clock to measure.
   'ref_id' = Clock used as reference.
   '*freq' = Measured frequency
   Note: not static to be callable from validation code
   Returns: 0=OK, -1=ERROR */
int RCC_FG_GetMeasure(uint32_t clk_id, uint32_t ref_id, uint32_t *freq)
{
  int fstatus;
  uint32_t freq_meas_complete_flag, fcalctwc_val, min_fcalctwc;
  uint32_t regval, fcalcsts_bit;
  uint32_t timeout_flag, timeout_in_ticks, tickstart;
  uint64_t ckin_freq_val;

  /* Initial checks */
  assert_param(clk_id != RCC_CK_NONE);
  assert_param(clk_id < RCC_CK_LAST);
  assert_param(ref_id != RCC_CK_NONE);
  assert_param(ref_id < RCC_CK_LAST);
  assert_param(freq != NULL);

  *freq = 0;

  /* Checking ref clock: can only be GFG input/ref clock */
  int ref_idx;
  ref_idx = RCC_FG_GetClockIdx(ref_id, RCC_Flexgen.msout_table, RCC_Flexgen.msout_size);
  if (ref_idx == -1)
  {
    return -1;
  }
  uint32_t ref_freq = HAL_RCC_GetFreq(ref_id);
  if (!ref_freq)
  {
    return -1;
  }

  /* If clock to measure is disabled, don't attempt to measure */
  if (!HAL_RCC_IsRunning(clk_id))
  {
    return 0;
  }

  /* ALGORITHM STARTS HERE. IT IS THE FOLLOWING :
   * While there is an overflow in measurement,
   * decrease FCALCTWC value from 15 (65535 cycles) to 1 (3 cycles).
   */
  freq_meas_complete_flag = 0;
  fcalctwc_val = 0xF;
  min_fcalctwc = 0x1;
  while ((fcalctwc_val >= min_fcalctwc)
         && (freq_meas_complete_flag == 0))
  {
    /* set the FCALCRSTN bit in the RCC Clock Frequency Calculator and Observation 1
     * clock Configuration Register (RCC_FCALCOBS1CFGR) to enable the clock frequency
     * calculator.
     */
    SET_BIT(RCC->FCALCOBS1CFGR, (1 << 27));

    /* set the CKINTSEL (or CKEXTSEL if FCALCCKEXTSEL bit is set) field in the RCC
     * Clock Frequency Calculator and Observation 0 Clock Configuration Register
     * (RCC_FCALCOBS0CFGR) to select the clock frequency calculator input clock
     * (i.e. ckin).
     */
    uint32_t ckintsel; // Selector of clock to measure
    if (RCC_FG_ID2Ckintsel(clk_id, &ckintsel) != 0)
    {
      return -1;
    }
    regval = RCC->FCALCOBS0CFGR;
    regval &= ~(0xFF);
    regval |= ckintsel;
    WRITE_REG(RCC->FCALCOBS0CFGR, regval);

    /* set the FCALCCKEN field in the RCC Clock Frequency Calculator and Observation 0
     * Clock Configuration Register (RCC_FCALCOBS0CFGR) to enable the selected input
     * clock at the input of clock frequency calculator.
     */
    regval = RCC->FCALCOBS0CFGR;
    regval |= (1 << 25);
    WRITE_REG(RCC->FCALCOBS0CFGR, regval);

