STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
    /* set the FCALCREFCKSEL field in the RCC Clock Frequency Calculator Reference
     * clock Configuration Register (RCC_FCALCREFCFGR) to select the reference clock
     * (i.e. ckref).
     */
    WRITE_REG(RCC->FCALCREFCFGR, ref_idx);

    /* set the clock frequency time window value via the FCALCTWC field in the RCC Clock
     * Frequency Calculator Control Register 2 (RCC_FCALCCR2)
     */
    regval = RCC->FCALCCR2;
    regval &= ~(0xF << 11);
    regval |= (fcalctwc_val << 11);
    WRITE_REG(RCC->FCALCCR2, regval);
    /* set the FCALCTYP field to 0x0C in the RCC Clock Frequency Calculator Control
     * Register 2 (RCC_FCALCCR2) to select the frequency value type.
     */
    regval = RCC->FCALCCR2;
    regval |= (0xC << 17);
    WRITE_REG(RCC->FCALCCR2, regval);
    /* select the application mode via the FCALCMD field in the RCC Clock Frequency
     * Calculator Control Register 2 (RCC_FCALCCR2).
     */
    regval = RCC->FCALCCR2;
    regval |= (0x3 << 3);
    WRITE_REG(RCC->FCALCCR2, regval);

    /* set the FCALCRUN bit in the RCC Clock Frequency Calculator Control Register 1
     * (RCC_FCALCCR1).
     */
    WRITE_REG(RCC->FCALCCR1, 1);

    /* poll the FCALCSTS bit in the RCC Clock Frequency Calculator Status Register
     * (RCC_FCALCSR) until the calculation is done.
     */
    fcalcsts_bit = 0;
    timeout_flag = 0;
    /* CI : timeout value (in ms) to be tuned according */
    /*      to lowest frequency to be measured */
    timeout_in_ticks = 100;

    tickstart = HAL_GetTick();
    while ((fcalcsts_bit == 0)
           && (timeout_flag == 0))
    {
      regval = RCC->FCALCSR;
      if ((regval & 0xFFFF) != 0)
      {
        fcalcsts_bit = (regval & (1 << 19)) >> 19;
      }
      /* detect timeout (time expired whereas counter still zero) */
      else if (HAL_GetTick() - tickstart > timeout_in_ticks)
      {
        timeout_flag = 1;
      }
    }
    /* read the measured value via the FVAL field in the RCC Clock Frequency Calculator
     * Status Register (RCC_FCALCSR). If FVAL[16] is 1 then the measured value is false.
     */
    /* detect overflow */
    if ((regval & (1 << 16)) == (1 << 16))
    {
      /* set status for next measurement iteration */
      fstatus = 0;
    }
    else if (1 == timeout_flag)
    {
      printf("<E> FCALCTWC = %ld : TIMEOUT - FVAL = %ld\n", fcalctwc_val, (regval & 0xFFFF));
      /* set status for leaving measurement algorithm */
      fstatus = -1;
    }
    else
    {
      if (0 == (regval & 0xFFFF))
      {
        printf("<W> FCALCTWC = %ld : FVAL = 0\n", fcalctwc_val);
        /* set status for leaving measurement algorithm */
        fstatus = -1;
      }
      else
      {
        /* compute measured frequency */
        ckin_freq_val = (uint64_t)((regval & 0xFFFF) - 16) * (uint64_t)ref_freq;
        uint32_t denom_val = (1 << (fcalctwc_val + 1)) + 5;
        ckin_freq_val /= (uint64_t)denom_val;
        *freq = (uint32_t)ckin_freq_val;
        freq_meas_complete_flag = 1;
        fstatus = 0;
      }
    }
    /* Re-initialisation : */
    /* clear the FCALCRUN bit in the RCC Clock Frequency Calculator
     * Control Register 1 (RCC_FCALCCR1)
     */
    WRITE_REG(RCC->FCALCCR1, 0);
    /* clear the FCALCRSTN bit in the RCC Clock Frequency Calculator and Observation 1
     * clock Configuration Register (RCC_FCALCOBS1CFGR) to disable the clock frequency
     * calculator.
     */
    CLEAR_BIT(RCC->FCALCOBS1CFGR, (1 << 27));

    /* Waiting for status register to be cleared : NOT SPECIFIED */
    timeout_flag = 0;
    timeout_in_ticks = 100; /* TO BE TUNED */
    tickstart = HAL_GetTick();
    regval = READ_REG(RCC->FCALCSR);
    while (((regval & 0xffff) != 0)
           && (timeout_flag == 0))
    {
      regval = READ_REG(RCC->FCALCSR);
      /* detect timeout */
      if (HAL_GetTick() - tickstart > timeout_in_ticks)
      {
        timeout_flag = 1;
      }
    }
    if (1 == timeout_flag)
    {
      printf("<E> FCALCSR not reset after TIMEOUT = %08lX\n", regval);
      printf("<E> Tick start / end = %08lX / %08lX\n", tickstart, HAL_GetTick());
      fstatus = -1;
    }
    /* decrease FCALCTWC value */
    fcalctwc_val -= 1;
    /* check status */
    if (-1 == fstatus)
    {
      break;
    }
  }
  return fstatus;
}

/* Configure observation path.
   'clk_id' = RCC_CK_OBS0 or RCC_CK_OBS1.
   'src_id' = Clock to observe
   'div' = Division factor to apply prior to observation
   Returns: 0=OK, -1=ERROR */
static int RCC_FG_SetObs(uint16_t clk_id, uint16_t src_id, uint32_t *div)
{
  assert_param(clk_id != RCC_CK_NONE);
  assert_param(clk_id < RCC_CK_LAST);
  assert_param(src_id != RCC_CK_NONE);
  assert_param(src_id < RCC_CK_LAST);
  assert_param(div != NULL);

  /* TODO: Need to add support of EXT clcoks */
  /* TODO: Must be generic code */
// extern const char *RCC_ClockNames[];
// extern int printf(const char *format, ...);
// printf("Routing %s to %s for observation\n", RCC_ClockNames[src_id], RCC_ClockNames[clk_id]);
  uint32_t obsext = 0;
  uint32_t ckintsel, ckextsel = 0;
  if (RCC_FG_ID2Ckintsel(src_id, &ckintsel) != 0)
  {
    return -1;
  }

  /* Computing closest but greater div.
     Only div by 1, 2 4, 8, 16, 32, 64 and 128 are supported */
  uint32_t obsdiv = 0;
  for (obsdiv = 0; obsdiv < 7; obsdiv++)
    if ((1 << obsdiv) >= *div) { break; }
      *div = 1 << obsdiv;

  volatile uint32_t *obscfg;
  if (clk_id == RCC_CK_OBS0)
  {
    obscfg = &(RCC->FCALCOBS0CFGR);
  }
  else
    obscfg = &(RCC->FCALCOBS1CFGR);

  if (obsext == 0)
  {
    WRITE_REGA(obscfg, (1 << 26) | (obsdiv << 22) | (ckintsel << 0));
  }
  else
    WRITE_REGA(obscfg, (1 << 26) | (obsdiv << 22) | (1 << 16) | (ckextsel << 8));

  return 0;
}

/* Get observation path config
   'clk_id' = RCC_CK_OBS0 or RCC_CK_OBS1.
   'src_id' = Clock to observe (pointer)
   'div' = Division factor to apply prior to observation (pointer)
   Returns: 0=OK, -1=ERROR */
static int RCC_FG_GetObs(uint16_t clk_id, uint16_t *src_id, uint32_t *div)
{
  assert_param(clk_id != RCC_CK_NONE);
  assert_param(clk_id < RCC_CK_LAST);
  assert_param(src_id != NULL);
  assert_param(div != NULL);

  /* TODO: Need to add support of EXT clcoks */
  /* TODO: Must be generic code */
// extern const char *RCC_ClockNames[];
// extern int printf(const char *format, ...);
// printf("Routing %s to %s for observation\n", RCC_ClockNames[src_id], RCC_ClockNames[clk_id]);
  // uint32_t obsext = 0;
  // uint32_t ckintsel, ckextsel = 0;
  // if (RCC_FG_ID2Ckintsel(src_id, &ckintsel) != 0)
  // return -1;

  uint32_t obscfg;
  if (clk_id == RCC_CK_OBS0)
  {
    obscfg = READ_REG(RCC->FCALCOBS0CFGR);
  }
  else
    obscfg = READ_REG(RCC->FCALCOBS1CFGR);

  /* Source ? */
  RCC_FG_Ckintsel2ID(obscfg & 0xff, src_id);

