STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
  /* Divider value ? */
  *div = 1 << ((obscfg >> 22) & 0x7);

  /* State */
  // if (obscfg & (1 << 26))
  // state = RCC_CLKSTATE_ON;
  // else
  // state = RCC_CLKSTATE_OFF;

  return 0;
}

/******************************************************************************
  * END of flexiclockgen management functions
  ******************************************************************************/

/** @defgroup RCC_Private_Functions RCC Private Functions
  * @{
  */

/** @defgroup RCC_Group1 Initialization and de-initialization functions
  *  @TODO:    Re-write this brief
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
           ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]
      This section provides functions allowing to configure the internal/external oscillators
      (HSE, HSI, LSE,CSI, LSI, PLL, CSS and MCO) and the System busses clocks (SYSCLK, AHB, APB1
       and APB2).

    [..] Internal/external clock and PLL configuration
         (#) HSI (high-speed internal), 64 MHz factory-trimmed RC used directly or through
             the PLL as System clock source.
         (#) CSI is a low-power RC oscillator which can be used directly as system clock, peripheral
             clock, or PLL input.But even with frequency calibration, is less accurate than an
             external crystal oscillator or ceramic resonator.
         (#) LSI (low-speed internal), 32 KHz low consumption RC used as IWDG and/or RTC
             clock source.

         (#) HSE (high-speed external), 4 to 48 MHz crystal oscillator used directly or
             through the PLL as System clock source. Can be used also as RTC clock source.

         (#) LSE (low-speed external), 32 KHz oscillator used as RTC clock source.

         (#) PLL , The RCC features three independent PLLs (clocked by HSI , HSE or CSI),
             featuring three different output clocks and able  to work either in integer or Fractional mode.
           (++) A main PLL, PLL1, which is generally used to provide clocks to the CPUs
                and to some peripherals.
           (++) Two dedicated PLLs, PLL2 and PLL3, which are used to generate the kernel clock for peripherals.

         (#) CSS (Clock security system), once enable and if a HSE clock failure occurs
            (HSE used directly or through PLL as System clock source), the System clock
             is automatically switched to HSI and an interrupt is generated if enabled.
             The interrupt is linked to the Cortex-M NMI (Non-Mask-able Interrupt)
             exception vector.

         (#) MCO1 (micro controller clock output), used to output HSI, LSE, HSE, PLL1(PLL1_Q)
             or HSI48 clock (through a configurable pre-scaler) on PA8 pin.

         (#) MCO2 (micro controller clock output), used to output HSE, PLL2(PLL2_P), SYSCLK,
             LSI, CSI, or PLL1(PLL1_P) clock (through a configurable pre-scaler) on PA14 pin.

    [..] System, AHB and APB buses clocks configuration
         (#) Several clock sources can be used to drive the System clock (SYSCLK): CSI,HSI,
             HSE and PLL.
             The AHB clock (HCLK) is derived from System core clock through configurable
             pre-scaler and used to clock the CPU, memory and peripherals mapped
             on AHB and APB bus of the 3 Domains (D1, D2, D3) through configurable pre-scalers
             and used to clock the peripherals mapped on these buses. You can use
             "HAL_RCC_GetSysClockFreq()" function to retrieve system clock frequency.

         -@- All the peripheral clocks are derived from the System clock (SYSCLK) except those
             with dual clock domain where kernel source clock could be selected through
             RCC_D1CCIPR,RCC_D2CCIP1R,RCC_D2CCIP2R and RCC_D3CCIPR registers

@endverbatim
  * @{
  */

/**
  * @brief  Resets the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *          - HSI ON and used as system clock source
  *          - HSE/CSI/PLL4..8 OFF
  *          - AHB, APB Bus pre-scaler set to 1.
  *          - MCO1 and MCO2 OFF
  *          - All interrupts disabled (except Wake-up from CSTOP Interrupt Enable)
  * @note   This function doesn't modify the configuration of the
  *          - Peripheral clocks
  *          - LSI, LSE and RTC clock
  *          - HSECSS and LSECSS
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_DeInit(void)
{
  /* Enable HSI */
  if (HAL_RCC_Xable(RCC_CK_HSI, 1) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Reroute all flexgen outputs to use HSI with div1 */
  RCC_ClkCfgTypeDef clk;
  uint16_t id;
  for (id = RCC_Flexgen.fdiv_first; id <= RCC_Flexgen.fdiv_last; id++)
  {
    clk.id = id;
    clk.source = RCC_CK_HSI;
    clk.divvalue = 1;
    clk.state = RCC_CLKSTATE_ON;
    if (HAL_RCC_SetClockCfg(&clk) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  /* Switch OFF all flexgen PLLs */
  RCC_PLLCfgTypeDef pll;
  for (id = RCC_CK_PLL4; id <= RCC_CK_PLL8; id++)
  {
    pll.id = id;
    HAL_RCC_GetPllCfg(&pll);
    pll.source = RCC_CK_HSI;
    pll.state = RCC_PLLSTATE_OFF;
    if (HAL_RCC_SetPllCfg(&pll) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  /* TODO: May need more cleanup on PLL registers */
  /* TODO: Specifically reset POSTDIVEN */

  /* Reroute all GFG ref to HSI */
  WRITE_REG(RCC->MUXSELCFGR, 0); // Is that not covered by HAL_RCC_SetPllCfg()

  /* Switch OFF HSE & CSI */
  if (HAL_RCC_Xable(RCC_CK_HSE, 0) != HAL_OK)
  {
    return HAL_ERROR;
  }
  if (HAL_RCC_Xable(RCC_CK_CSI, 0) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Reset MCOx configuration registers */
  CLEAR_REG(RCC->MCO1CFGR);
  CLEAR_REG(RCC->MCO2CFGR);

  /* Reset APB dividers */
  CLEAR_REG(RCC->APB1DIVR);
  CLEAR_REG(RCC->APB2DIVR);
  CLEAR_REG(RCC->APB3DIVR);
  CLEAR_REG(RCC->APB4DIVR);

  /* TODO: PLL1 ? */
  /* TODO: PLL2 ? */
  /* TODO: PLL3 ? */

