STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
  /* Adapt Systick interrupt period for 1ms */
  if (HAL_InitTick(TICK_INT_PRIORITY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
#if O_CODE
  uint32_t tickstart;

  /* Disable PLL1 outputs */
  CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_DIVPEN | RCC_PLL1CR_DIVQEN |
            RCC_PLL1CR_DIVREN);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Disable PLL1 */
  CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_PLLON);

  /* Wait till PLL is disabled */
  while ((RCC->PLL1CR & RCC_PLL1CR_PLL1RDY) != 0U)
  {
    if ((int32_t)(HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Clear remaining SSCG_CTRL bit */
  CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_SSCG_CTRL);

  /* Disable PLL2 outputs */
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVPEN | RCC_PLL2CR_DIVQEN |
            RCC_PLL2CR_DIVREN);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Disable PLL2 */
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_PLLON);

  /* Wait till PLL is disabled */
  while ((RCC->PLL2CR & RCC_PLL2CR_PLL2RDY) != 0U)
  {
    if ((int32_t)(HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Clear remaining SSCG_CTRL bit */
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_SSCG_CTRL);

  /* Disable PLL3 outputs */
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVPEN | RCC_PLL3CR_DIVQEN |
            RCC_PLL3CR_DIVREN);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Disable PLL3 */
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_PLLON);

  /* Wait till PLL is disabled */
  while ((RCC->PLL3CR & RCC_PLL3CR_PLL3RDY) != 0U)
  {
    if ((int32_t)(HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Clear remaining SSCG_CTRL bit */
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_SSCG_CTRL);

  /* Disable PLL4 outputs */
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVPEN | RCC_PLL4CR_DIVQEN |
            RCC_PLL4CR_DIVREN);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Disable PLL4 */
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_PLLON);

  /* Wait till PLL is disabled */
  while ((RCC->PLL4CR & RCC_PLL4CR_PLL4RDY) != 0U)
  {
    if ((int32_t)(HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Clear remaining SSCG_CTRL bit */
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_SSCG_CTRL);

  /* Reset PLL 1 and 2 Ref. Clock Selection Register */
  MODIFY_REG(RCC->RCK12SELR, (RCC_RCK12SELR_PLL12SRC), RCC_RCK12SELR_PLL12SRC_0);

  /* Reset RCC PLL 3 Ref. Clock Selection Register */
  MODIFY_REG(RCC->RCK3SELR, (RCC_RCK3SELR_PLL3SRC), RCC_RCK3SELR_PLL3SRC_0);

  /* Reset PLL4 Ref. Clock Selection Register */
  MODIFY_REG(RCC->RCK4SELR, (RCC_RCK4SELR_PLL4SRC), RCC_RCK4SELR_PLL4SRC_0);

  /* Reset RCC PLL1 Configuration Register 1 */
  WRITE_REG(RCC->PLL1CFGR1, 0x00010031U);

  /* Reset RCC PLL1 Configuration Register 2 */
  WRITE_REG(RCC->PLL1CFGR2, 0x00010100U);

  /* Reset RCC PLL1 Fractional Register */
  CLEAR_REG(RCC->PLL1FRACR);

  /* Reset RCC PLL1 Clock Spreading Generator Register */
  CLEAR_REG(RCC->PLL1CSGR);

  /* Reset RCC PLL2 Configuration Register 1 */
  WRITE_REG(RCC->PLL2CFGR1, 0x00010063U);

  /* Reset RCC PLL2 Configuration Register 2 */
  WRITE_REG(RCC->PLL2CFGR2, 0x00010101U);

  /* Reset RCC PLL2 Fractional Register */
  CLEAR_REG(RCC->PLL2FRACR);

  /* Reset RCC PLL2 Clock Spreading Generator Register */
  CLEAR_REG(RCC->PLL2CSGR);

  /* Reset RCC PLL3 Configuration Register 1 */
  WRITE_REG(RCC->PLL3CFGR1, 0x00010031U);

  /* Reset RCC PLL3 Configuration Register 2 */
  WRITE_REG(RCC->PLL3CFGR2, 0x00010101U);

  /* Reset RCC PLL3 Fractional Register */
  CLEAR_REG(RCC->PLL3FRACR);

  /* Reset RCC PLL3 Clock Spreading Generator Register */
  CLEAR_REG(RCC->PLL3CSGR);

  /* Reset RCC PLL4 Configuration Register 1 */
  WRITE_REG(RCC->PLL4CFGR1, 0x00010031U);

  /* Reset RCC PLL4 Configuration Register 2 */
  WRITE_REG(RCC->PLL4CFGR2, 0x00000000U);

  /* Reset RCC PLL4 Fractional Register */
  CLEAR_REG(RCC->PLL4FRACR);

  /* Reset RCC PLL4 Clock Spreading Generator Register */
  CLEAR_REG(RCC->PLL4CSGR);

  /* Reset HSIDIV once PLLs are off */
  CLEAR_BIT(RCC->HSICFGR, RCC_HSICFGR_HSIDIV);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till HSIDIV is ready */
  while ((RCC->OCRDYR & RCC_OCRDYR_HSIDIVRDY) == 0U)
  {
    if ((int32_t)(HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Reset HSITRIM value */
  CLEAR_BIT(RCC->HSICFGR, RCC_HSICFGR_HSITRIM);

  /* Reset the Oscillator Enable Control registers */
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSIKERON | RCC_OCENCLRR_CSION |
            RCC_OCENCLRR_CSIKERON | RCC_OCENCLRR_HSEDIGBYP | RCC_OCENCLRR_HSEON |
            RCC_OCENCLRR_HSEKERON | RCC_OCENCLRR_HSEBYP);

  /* Clear LSION bit */
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSION);

  /* Reset CSITRIM value */
  CLEAR_BIT(RCC->CSICFGR, RCC_CSICFGR_CSITRIM);

#ifdef CORE_CA35
  /* Clear RCC CPU1 Clock Source Interrupt Enable Set Register */
  CLEAR_BIT(RCC->C1CIESETR, (RCC_C1CIESETR_LSIRDYIE | RCC_C1CIESETR_LSERDYIE |
                             RCC_C1CIESETR_HSIRDYIE | RCC_C1CIESETR_HSERDYIE |
                             RCC_C1CIESETR_CSIRDYIE | RCC_C1CIESETR_PLL1DYIE | RCC_C1CIESETR_PLL2DYIE |
                             RCC_C1CIESETR_PLL3DYIE | RCC_C1CIESETR_PLL4DYIE | RCC_C1CIESETR_PLL5DYIE |
                             RCC_C1CIESETR_PLL6DYIE | RCC_C1CIESETR_PLL7DYIE | RCC_C1CIESETR_PLL8DYIE |
                             RCC_C1CIESETR_LSECSSIE | RCC_C1CIESETR_WKUPIE));

  /* Clear all MPU interrupt flags */
  /* in RCC CPU1 Clock Source Interrupt Flag Clear Register */
  SET_BIT(RCC->C1CIFCLRR, (RCC_C1CIFCLRR_LSIRDYF | RCC_C1CIFCLRR_LSERDYF |
                           RCC_C1CIFCLRR_HSIRDYF | RCC_C1CIFCLRR_HSERDYF |
                           RCC_C1CIFCLRR_CSIRDYF | RCC_C1CIFCLRR_PLL1DYF | RCC_C1CIFCLRR_PLL2DYF |
                           RCC_C1CIFCLRR_PLL3DYF | RCC_C1CIFCLRR_PLL4DYF | RCC_C1CIFCLRR_PLL5DYF |
                           RCC_C1CIFCLRR_PLL6DYF | RCC_C1CIFCLRR_PLL7DYF | RCC_C1CIFCLRR_PLL8DYF |
                           RCC_C1CIFCLRR_LSECSSF | RCC_C1CIFCLRR_WKUPF));

  /* Clear all RCC MPU Reset flags */
  /* in RCC CPU1 BOOT Reset Status Clear Register */
  SET_BIT(RCC->C1BOOTRSTSCLRR, (RCC_C1BOOTRSTSCLRR_PORRSTF |
                                RCC_C1BOOTRSTSCLRR_BORRSTF | RCC_C1BOOTRSTSCLRR_PADRSTF |
                                RCC_C1BOOTRSTSCLRR_HCSSRSTF | RCC_C1BOOTRSTSCLRR_VCORERSTF |
                                RCC_C1BOOTRSTSCLRR_VCPURSTF | RCC_C1BOOTRSTSCLRR_SYSC1RSTF |
                                RCC_C1BOOTRSTSCLRR_SYSC2RSTF | RCC_C1BOOTRSTSCLRR_IWDG1SYSRSTF |
                                RCC_C1BOOTRSTSCLRR_IWDG2SYSRSTF | RCC_C1BOOTRSTSCLRR_IWDG3SYSRSTF |
                                RCC_C1BOOTRSTSCLRR_IWDG4SYSRSTF | RCC_C1BOOTRSTSCLRR_IWDG5SYSRSTF |
                                RCC_C1BOOTRSTSCLRR_C1RSTF | RCC_C1BOOTRSTSCLRR_C1P1RSTF |
                                RCC_C1BOOTRSTSCLRR_RETCRCERRRSTF | RCC_C1BOOTRSTSCLRR_RETECCFAILCRCRSTF |
                                RCC_C1BOOTRSTSCLRR_RETECCFAILRESTRSTF | RCC_C1BOOTRSTSCLRR_STBYC1RSTF |
                                RCC_C1BOOTRSTSCLRR_D1STBYRSTF | RCC_C1BOOTRSTSCLRR_D2STBYRSTF |
                                RCC_C1BOOTRSTSCLRR_IWDG1LOCRSTF | RCC_C1BOOTRSTSCLRR_IWDG2LOCRSTF));
#endif

