STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
#ifdef CORE_CM33
  /* Clear RCC CPU2 Clock Source Interrupt Enable Register */
  CLEAR_BIT(RCC->C2CIESETR, (RCC_C2CIESETR_LSIRDYIE | RCC_C2CIESETR_LSERDYIE |
                             RCC_C2CIESETR_HSIRDYIE | RCC_C2CIESETR_HSERDYIE |
                             RCC_C2CIESETR_CSIRDYIE | RCC_C2CIESETR_PLL1DYIE | RCC_C2CIESETR_PLL2DYIE |
                             RCC_C2CIESETR_PLL3DYIE | RCC_C2CIESETR_PLL4DYIE | RCC_C2CIESETR_PLL5DYIE |
                             RCC_C2CIESETR_PLL6DYIE | RCC_C2CIESETR_PLL7DYIE | RCC_C2CIESETR_PLL8DYIE |
                             RCC_C2CIESETR_LSECSSIE | RCC_C2CIESETR_WKUPIE));

  /* Clear all MCU interrupt flags */
  /* in RCC CPU2 Clock Source Interrupt Flag Clear Register */
  SET_BIT(RCC->C2CIFCLRR, (RCC_C2CIFCLRR_LSIRDYF | RCC_C2CIFCLRR_LSERDYF |
                           RCC_C2CIFCLRR_HSIRDYF | RCC_C2CIFCLRR_HSERDYF |
                           RCC_C2CIFCLRR_CSIRDYF | RCC_C2CIFCLRR_PLL1DYF | RCC_C2CIFCLRR_PLL2DYF |
                           RCC_C2CIFCLRR_PLL3DYF | RCC_C2CIFCLRR_PLL4DYF | RCC_C2CIFCLRR_PLL5DYF |
                           RCC_C2CIFCLRR_PLL6DYF | RCC_C2CIFCLRR_PLL7DYF | RCC_C2CIFCLRR_PLL8DYF |
                           RCC_C2CIFCLRR_LSECSSF | RCC_C2CIFCLRR_WKUPF));

  /* Clear all RCC MCU Reset Flags */
  /* in RCC CPU2 BOOT Reset Status Clear Register */
  SET_BIT(RCC->C2BOOTRSTSCLRR, (RCC_C2BOOTRSTSCLRR_PORRSTF |
                                RCC_C2BOOTRSTSCLRR_BORRSTF | RCC_C2BOOTRSTSCLRR_PADRSTF |
                                RCC_C2BOOTRSTSCLRR_HCSSRSTF | RCC_C2BOOTRSTSCLRR_VCORERSTF |
                                RCC_C2BOOTRSTSCLRR_SYSC1RSTF |
                                RCC_C2BOOTRSTSCLRR_SYSC2RSTF | RCC_C2BOOTRSTSCLRR_IWDG1SYSRSTF |
                                RCC_C2BOOTRSTSCLRR_IWDG2SYSRSTF | RCC_C2BOOTRSTSCLRR_IWDG3SYSRSTF |
                                RCC_C2BOOTRSTSCLRR_IWDG4SYSRSTF | RCC_C2BOOTRSTSCLRR_IWDG5SYSRSTF |
                                RCC_C2BOOTRSTSCLRR_C2RSTF |
                                RCC_C2BOOTRSTSCLRR_RETCRCERRRSTF | RCC_C2BOOTRSTSCLRR_RETECCFAILCRCRSTF |
                                RCC_C2BOOTRSTSCLRR_RETECCFAILRESTRSTF | RCC_C2BOOTRSTSCLRR_STBYC2RSTF |
                                RCC_C2BOOTRSTSCLRR_D2STBYRSTF |
                                RCC_C2BOOTRSTSCLRR_IWDG3LOCRSTF | RCC_C2BOOTRSTSCLRR_IWDG4LOCRSTF));
#endif

  /* Update the SystemCoreClock global variable */
  SystemCoreClock = HSI_VALUE;

  /* Adapt Systick interrupt period */
  if (HAL_InitTick(TICK_INT_PRIORITY) != HAL_OK)
  {
    return HAL_ERROR;
  }
#endif
}

/* Returns: 1 if clock ready, 0 else */
int HAL_RCC_IsReady(uint32_t clk_id)
{
  int ready;
  switch (clk_id)
  {
    case RCC_CK_HSE:
      ready = (READ_REG(RCC->OCRDYR) & RCC_OCRDYR_HSERDY);
      break;
    case RCC_CK_HSI:
      ready = (READ_REG(RCC->OCRDYR) & RCC_OCRDYR_HSIRDY);
      break;
    case RCC_CK_LSI:
      ready = (READ_REG(RCC->BDCR) & RCC_BDCR_LSIRDY);
      break;
    case RCC_CK_LSE:
      ready = (READ_REG(RCC->BDCR) & RCC_BDCR_LSERDY);
      break;
    case RCC_CK_CSI:
      ready = (READ_REG(RCC->D3DCR) & RCC_D3DCR_CSIRDY);
      break;
    default:
      return 0;
  }

  if (ready)
  {
    return 1;
  }
  return 0;
}

/* How to decide it's IN USE ?
   Returns: 1 if clock is in use, 0 else */
int HAL_RCC_OscIsInUse(RCC_OscCfgTypeDef *osc)
{
  int ready = 0;
  switch (osc->id)
  {
    case RCC_CK_HSE:
      ready = (RCC->OCRDYR & RCC_OCRDYR_HSERDY);
      break;
    case RCC_CK_HSI:
      ready = (RCC->OCRDYR & RCC_OCRDYR_HSIRDY);
      break;
    case RCC_CK_LSI:
      ready = (RCC->BDCR & RCC_BDCR_LSIRDY);
      break;
    case RCC_CK_LSE:
      ready = (RCC->BDCR & RCC_BDCR_LSERDY);
      break;
    case RCC_CK_CSI:
      ready = (RCC->D3DCR & RCC_D3DCR_CSIRDY);
      break;
    default:
      return HAL_ERROR;
  }

  return ready;
}

/* Enable or disable clock and wait for completion.
 * @param  clk_id: Clock ID
 * @param  enable: 1 to enable, 0 to disable
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_RCC_Xable(uint32_t clk_id, int enable)
{
  switch (clk_id)
  {
    case RCC_CK_HSE:
    case RCC_CK_HSE_KER:
      if (enable)
      {
        SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEON);
        if (RCC_Wait((void *)&RCC->OCRDYR, RCC_OCRDYR_HSERDY, RCC_OCRDYR_HSERDY, HSE_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      else
      {
        WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSEON);
        if (RCC_Wait((void *)&RCC->OCRDYR, RCC_OCRDYR_HSERDY, 0, HSE_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      break;
    case RCC_CK_HSI:
    case RCC_CK_HSI_KER:
      if (enable)
      {
        SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSION);
        if (RCC_Wait((void *)&RCC->OCRDYR, RCC_OCRDYR_HSIRDY, RCC_OCRDYR_HSIRDY, HSI_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      else
      {
        WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSION);
        if (RCC_Wait((void *)&RCC->OCRDYR, RCC_OCRDYR_HSIRDY, 0, HSI_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      break;
    case RCC_CK_CSI:
    case RCC_CK_CSI_KER:
      if (enable)
      {
        SET_BIT(RCC->D3DCR, RCC_D3DCR_CSION);
        if (RCC_Wait((void *)&RCC->D3DCR, RCC_D3DCR_CSIRDY, RCC_D3DCR_CSIRDY, CSI_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      else
      {
        CLEAR_BIT(RCC->D3DCR, RCC_D3DCR_CSION);
        if (RCC_Wait((void *)&RCC->D3DCR, RCC_D3DCR_CSIRDY, 0, CSI_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      break;
    case RCC_CK_LSI:
      RCC_XableProtection(0); /* Disable BDCR protection */
      if (enable)
      {
        SET_BIT(RCC->BDCR, RCC_BDCR_LSION);
        if (RCC_Wait((void *)&RCC->BDCR, RCC_BDCR_LSIRDY, RCC_BDCR_LSIRDY, LSI_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      else
      {
        CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSION);
        if (RCC_Wait((void *)&RCC->BDCR, RCC_BDCR_LSIRDY, 0, LSI_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      RCC_XableProtection(1);
      break;
    case RCC_CK_LSE:
      RCC_XableProtection(0); /* Disable BDCR protection */
      if (enable)
      {
        SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);
        if (RCC_Wait((void *)&RCC->BDCR, RCC_BDCR_LSERDY, RCC_BDCR_LSERDY, RCC_LSE_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      else
      {
        CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);
        if (RCC_Wait((void *)&RCC->BDCR, RCC_BDCR_LSERDY, 0, RCC_LSE_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      RCC_XableProtection(1);
      break;
    /* Flexiclockgen clocks */
    case RCC_CK_PLL4 ... RCC_CK_PLL8:
    case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
      if (RCC_FG_Xable(clk_id, enable) != 0)
      {
        return HAL_ERROR;
      }
      break;
    case RCC_CK_RTC:
      RCC_XableProtection(0); // Disable write protection
      if (enable)
      {
        SET_BIT(RCC->BDCR, RCC_BDCR_RTCCKEN);
      }
      else
        CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCCKEN);
      RCC_XableProtection(1); // Reenable write protection
      break;
#ifdef CORE_CA35
    case RCC_CK_PLL1:
    {
      __HAL_RCC_SYSCPU1_CLK_ENABLE(); // Required for SSC access
#define A3x_SS_PLL_ENABLE 0xa0
      /* TODO: To be updated when A53SSC_BASE exists */
      volatile void *a53_pll_en = (void *)A35SSC_BASE + A3x_SS_PLL_ENABLE;
      if (enable)
      {
        SET_BITA(a53_pll_en, (1 << 0)); // Set PLL_EN
        if (RCC_Wait(a53_pll_en, (1 << 1), (1 << 1), PLL_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
      else
      {
        CLEAR_BITA(a53_pll_en, (1 << 0)); // Clear PLL_EN
        if (RCC_Wait(a53_pll_en, (1 << 1), 0, PLL_TIMEOUT_VALUE) != HAL_OK)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    break;
#endif
    default:
      return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Initializes the RCC Oscillators according to the specified parameters in the
  *         RCC_OscCfgTypeDef.
  * @param  osc: pointer to a 'RCC_OscCfgTypeDef' structure that
  *         containing the oscilator configuration information.
  * @retval HAL status
  */
__weak HAL_StatusTypeDef HAL_RCC_SetOscCfg(RCC_OscCfgTypeDef *osc)
{
  /* Some checks */
  assert_param(osc != NULL);
  assert_param(osc->id != RCC_CK_NONE);
  assert_param(osc->id < RCC_CK_LAST);
  assert_param(RCC_VALID_OSCSTATE(osc->state));
  /* Note: don't check state since real HW status may not be known
  if (HAL_RCC_OscIsReady(osc) && (osc->state != RCC_OSCSTATE_ON))
      return HAL_ERROR; // Unexpected state
  if (!HAL_RCC_OscIsReady(osc) && (osc->state == RCC_OSCSTATE_ON))
      return HAL_ERROR; // Unexpected state
  */

  HAL_StatusTypeDef status;
  switch (osc->id)
  {
    case RCC_CK_HSE:
      /* HSE Configuration:
         If in use, do nothing. */
      if (!HAL_RCC_OscIsInUse(osc))
      {
        /* Configure HSE oscillator */
        /* Disable HSEON before configuring the HSE --------------*/
        status = HAL_RCC_Xable(RCC_CK_HSE, 0);
        if (status != HAL_OK)
        {
          return status;
        }

        /* Clear remaining bits */

        WRITE_REG(RCC->OCENCLRR, (RCC_OCENCLRR_HSEDIGBYP | RCC_OCENCLRR_HSEBYP));

