STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
        /* Enable HSE if needed ---------------------------------------*/
        if (osc->state != RCC_OSCSTATE_OFF)
        {
          if (osc->state == RCC_OSCSTATE_BYPASS)
          {
            SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEBYP);
          }
          else if (osc->state == RCC_OSCSTATE_DIGBYPASS)
          {
            SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEDIGBYP | RCC_OCENSETR_HSEBYP);
          }

          /* Enable oscillator */
          status = HAL_RCC_Xable(RCC_CK_HSE, 1);
          if (status != HAL_OK)
          {
            return status;
          }
        }
      }
      break;
    case RCC_CK_HSI:
      /* HSI Configuration
         If OFF requested and in use, do nothing */
      if (osc->state != RCC_OSCSTATE_OFF)
      {
        /* Enable the Internal High Speed oscillator (HSI). */
        status = HAL_RCC_Xable(RCC_CK_HSI, 1);
        if (status != HAL_OK)
        {
          return status;
        }

        /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
        __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(osc->calibrationvalue);
      }
      else if (!HAL_RCC_OscIsInUse(osc))
      {
        /* Disable the Internal High Speed oscillator (HSI). */
        status = HAL_RCC_Xable(RCC_CK_HSI, 0);
        if (status != HAL_OK)
        {
          return status;
        }
      }
      break;
    case RCC_CK_CSI:
      /* CSI Configuration
         Disabled only if unused */
      if (osc->state != RCC_OSCSTATE_OFF)
      {
        /* Enable the Internal High Speed oscillator (CSI). */
        status = HAL_RCC_Xable(RCC_CK_CSI, 1);
        if (status != HAL_OK)
        {
          return status;
        }

        /* Adjusts the Internal High Speed oscillator (CSI) calibration value.*/
        __HAL_RCC_CSI_CALIBRATIONVALUE_ADJUST(osc->calibrationvalue);
      }
      else if (!HAL_RCC_OscIsInUse(osc))
      {
        /* Disable the Internal High Speed oscillator (CSI). */
        status = HAL_RCC_Xable(RCC_CK_CSI, 0);
        if (status != HAL_OK)
        {
          return status;
        }
      }
      else
      {
        /* Adjusts the Internal High Speed oscillator (CSI) calibration value.*/
        __HAL_RCC_CSI_CALIBRATIONVALUE_ADJUST(osc->calibrationvalue);
      }
      break;
    case RCC_CK_LSI:
      /* LSI Configuration */
      if (osc->state != RCC_OSCSTATE_OFF)
      {
        /* Enable the Internal Low Speed oscillator (LSI). */
        status = HAL_RCC_Xable(RCC_CK_LSI, 1);
        if (status != HAL_OK)
        {
          return status;
        }
      }
      else
      {
        /* Disable the Internal Low Speed oscillator (LSI). */
        status = HAL_RCC_Xable(RCC_CK_LSI, 0);
        if (status != HAL_OK)
        {
          return status;
        }
      }
      break;
    case RCC_CK_LSE:
      /* LSE Configuration */
      if (osc->drivevalue > RCC_OSCDRIVE_HIGH)
      {
        return HAL_ERROR;  // Invalid param
      }

      /* Turning LSE off is needed before configuring */
      status = HAL_RCC_Xable(RCC_CK_LSE, 0);
      if (status != HAL_OK)
      {
        return status;
      }

      RCC_XableProtection(0); // Disable BDCR protection

      /* Clear remaining bits */
      CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEDIGBYP | RCC_BDCR_LSEBYP);

      /* Enable LSE if needed */
      if (osc->state != RCC_OSCSTATE_OFF)
      {
        if (osc->state == RCC_OSCSTATE_BYPASS)
        {
          SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
        }
        else if (osc->state == RCC_OSCSTATE_DIGBYPASS)
        {
          SET_BIT(RCC->BDCR, RCC_BDCR_LSEDIGBYP | RCC_BDCR_LSEBYP);
        }

        MODIFY_REG(RCC->BDCR, RCC_BDCR_LSEDRV, osc->drivevalue << RCC_BDCR_LSEDRV_Pos);

        /* Enable oscillator */
        status = HAL_RCC_Xable(RCC_CK_LSE, 1);
        if (status != HAL_OK)
        {
          return status;
        }
      }

      RCC_XableProtection(1); // Restore BDCR protection
      break;
    default:
      return HAL_ERROR; // Unexpected clock
  }

  return HAL_OK;
}

/* Get PLL2 or PLL3 config (PLLTS16FFCLAFRAC2) */
static HAL_StatusTypeDef RCC_GetPLL23(RCC_PLLCfgTypeDef *pll)
{
  assert_param(pll != NULL);
  assert_param(pll->id != RCC_CK_NONE);
  assert_param(pll->id < RCC_CK_LAST);

  void *cfgr1, *cfgr2, *cfgr3, *cfgr4, *cfgr5, *cfgr6, *cfgr7;
  switch (pll->id)
  {
    case RCC_CK_PLL2:
      cfgr1 = (void *)&RCC->PLL2CFGR1;
      cfgr2 = (void *)&RCC->PLL2CFGR2;
      cfgr3 = (void *)&RCC->PLL2CFGR3;
      cfgr4 = (void *)&RCC->PLL2CFGR4;
      cfgr5 = (void *)&RCC->PLL2CFGR5;
      cfgr6 = (void *)&RCC->PLL2CFGR6;
      cfgr7 = (void *)&RCC->PLL2CFGR7;
      break;
    case RCC_CK_PLL3:
      cfgr1 = (void *)&RCC->PLL3CFGR1;
      cfgr2 = (void *)&RCC->PLL3CFGR2;
      cfgr3 = (void *)&RCC->PLL3CFGR3;
      cfgr4 = (void *)&RCC->PLL3CFGR4;
      cfgr5 = (void *)&RCC->PLL3CFGR5;
      cfgr6 = (void *)&RCC->PLL3CFGR6;
      cfgr7 = (void *)&RCC->PLL3CFGR7;
      break;
    default:
      return -1; // Invalid PLL
  }

  /* Source identification.
     REMINDER: PLL is statically connected to xxREF. PLL source identification
               must therefore be done on xxREF clock */
  uint16_t ref_id; // PLL ref clock (RCC_CK_PLLxREF)
  ref_id = RCC_CK_PLL2REF + (pll->id - RCC_CK_PLL2);
  if (RCC_FG_GetSource(ref_id, &pll->source) != 0)
  {
    return -1;
  }

  uint32_t val;

  /* State ?
     Note: ON means enabled (PLLEN) and ready (PLLRDY)
     Note: Bypass state does not reflect PLL state (may be ON or OFF but unused) */
  pll->state = 0;
  if (READ_REGA(cfgr4) & (1 << 10)) // Bypassed ?
  {
    pll->state |= RCC_PLLSTATE_BYPASS;
  }
  val = READ_REGA(cfgr1);
  if ((val & (1 << 8)) && (val & (1 << 24))) // PLLEN=1 + PLLRDY=1
  {
    pll->state |= RCC_PLLSTATE_ON;
  }
  else
    pll->state |= RCC_PLLSTATE_OFF;

  pll->flags = 0; // Integer, DAC disabled, SSCG disabled, SSCG center

  val = READ_REGA(cfgr2);
  pll->frefdiv = (val >> 0) & 0x3f;
  pll->fbdiv = (val >> 16) & 0xfff;

  /* Frac or integer ? */
  val = READ_REGA(cfgr4);
  if (val & (1 << 8)) // DSMEN
  {
    pll->flags |= RCC_PLLFLAG_FRACTIONAL;
  }
  val = READ_REGA(cfgr3);
  pll->frac_in = val & 0xffffff;
  if (val & (1 << 25))
  {
    pll->flags |= RCC_PLLFLAG_DAC_ON;
  }

