STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
  /* SSCG status */
  val = READ_REGA(cfgr5);
  pll->sscg_moddepth = (val >> 16) & 0x1f; // Modulation depth
  pll->sscg_modfreq = (val >> 0) & 0xf; // Modulation freq
  val = READ_REGA(cfgr3);
  if (val & (1 << 24)) // DOWNSPREAD
  {
    pll->flags |= RCC_PLLFLAG_SSCG_DOWN;
  }
  if ((val & (1 << 26)) == 0) // SSCGDIS
  {
    pll->flags |= RCC_PLLFLAG_SSCG_ON;
  }

  /* Output status */
  if (READ_REGA(cfgr4) & (1 << 9))   // FOUTPOSTDIVEN
  {
    pll->postdiv1 = READ_REGA(cfgr6) & 0x7;
    pll->postdiv2 = READ_REGA(cfgr7) & 0x7;
  }
  else
  {
    /* Fout postdiv disabled => resulting div = 1 */
    pll->postdiv1 = 1;
    pll->postdiv2 = 1;
  }

  return 0;
}

/* Configure PLL2 or PLL3 (PLLTS16FFCLAFRAC2) */
static HAL_StatusTypeDef RCC_SetPLL23(RCC_PLLCfgTypeDef *pll)
{
  assert_param(pll != NULL);
  assert_param(pll->id != RCC_CK_NONE);
  assert_param(pll->id < RCC_CK_LAST);
  assert_param(pll->source != RCC_CK_NONE);
  assert_param(pll->source < RCC_CK_LAST);

  void *cfgr1, *cfgr2, *cfgr3, *cfgr4, *cfgr5, *cfgr6, *cfgr7;
  uint32_t ref_id; // PLL ref clock ID
  switch (pll->id)
  {
    case RCC_CK_PLL2:
      cfgr1 = (void *)&RCC->PLL2CFGR1;
      cfgr2 = (void *)&RCC->PLL2CFGR2;
      cfgr3 = (void *)&RCC->PLL2CFGR3;
      cfgr4 = (void *)&RCC->PLL2CFGR4;
      cfgr5 = (void *)&RCC->PLL2CFGR5;
      cfgr6 = (void *)&RCC->PLL2CFGR6;
      cfgr7 = (void *)&RCC->PLL2CFGR7;
      ref_id = RCC_CK_PLL2REF;
      break;
    case RCC_CK_PLL3:
      cfgr1 = (void *)&RCC->PLL3CFGR1;
      cfgr2 = (void *)&RCC->PLL3CFGR2;
      cfgr3 = (void *)&RCC->PLL3CFGR3;
      cfgr4 = (void *)&RCC->PLL3CFGR4;
      cfgr5 = (void *)&RCC->PLL3CFGR5;
      cfgr6 = (void *)&RCC->PLL3CFGR6;
      cfgr7 = (void *)&RCC->PLL3CFGR7;
      ref_id = RCC_CK_PLL3REF;
      break;
    default:
      return HAL_ERROR; // Invalid PLL
  }

  /* Checking PLL source clock ID.
     Note: It can only be one of the MUXSEL external outputs */
  int in_idx;
  in_idx = RCC_FG_GetClockIdx(pll->source, RCC_Flexgen.ref_table, RCC_Flexgen.ref_size);
  if (in_idx == -1)
  {
    return HAL_ERROR;  // Invalid source
  }

  /* PLLTS16FFCLAFRAC2 setup order:
     - Set bypass (supported by PLL1 ?)
     - Disable postdiv (supported by PLL1 ?) then VCO
     - Select source
     - Configure PLL
     - Enable PLL if RCC_PLLSTATE_ON
     - Remove bypass if NOT RCC_PLLSTATE_BYPASS (supported by PLL1 ?)
   */

  /* Check FREF
     Must be running and in good range */
  /* TODO */

  /* Bypass, in case PLL is used */
  SET_BITA(cfgr4, (1 << 10));

  /* Disable post div then PLL */
  CLEAR_BITA(cfgr4, 1 << 9); // FOUTPOSTDIVEN=0
  CLEAR_BITA(cfgr1, 1 << 8); // PLLEN

  /* Select PLL ref source */
  if (RCC_FG_SetSource(ref_id, pll->source) != 0)
  {
    return HAL_ERROR;
  }

  /* Configure PLL */
  uint32_t sscg_dis, dacen, downspread;
  sscg_dis = (pll->flags & RCC_PLLFLAG_SSCG_ON) ? 0 : 1;
  dacen = (pll->flags & RCC_PLLFLAG_DAC_ON) ? 1 : 0;
  downspread = (pll->flags & RCC_PLLFLAG_SSCG_DOWN) ? 1 : 0;
  uint32_t dsmen, postdiven;
  dsmen = (pll->flags & RCC_PLLFLAG_FRACTIONAL) ? 1 : 0;
  if ((!pll->postdiv1 && !pll->postdiv2) ||
      ((pll->postdiv1 == 1) && (pll->postdiv2 == 1)))
  {
    postdiven = 0;  // FOUTPOSTDIVEN=0
  }
  else
    postdiven = 1; // FOUTPOSTDIVEN=1
  WRITE_REGA(cfgr2, (pll->fbdiv << 16) | pll->frefdiv);
  WRITE_REGA(cfgr3, (sscg_dis << 26) | (dacen << 25) | (downspread << 24) | pll->frac_in);
  WRITE_REGA(cfgr4, (1 << 10) | (postdiven << 9) | (dsmen << 8)); // Keep bypass + foutpostdiven
  WRITE_REGA(cfgr5, (pll->sscg_moddepth << 16) | pll->sscg_modfreq);
  WRITE_REGA(cfgr6, pll->postdiv1); // Postdiv1
  WRITE_REGA(cfgr7, pll->postdiv2); // Postdiv2

  if (pll->state & RCC_PLLSTATE_ON)   // VCO ON
  {
    /* Enable PLL */
    SET_BITA(cfgr1, 1 << 8); // PLLEN
    /* Wait for lock */
    if (RCC_Wait(cfgr1, 1 << 24, 1 << 24, PLL_TIMEOUT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  /* Remove bypass */
  if ((pll->state & RCC_PLLSTATE_BYPASS) == 0)
  {
    CLEAR_BITA(cfgr4, (1 << 10));  // Remove bypass
  }

  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_GetPllCfg(RCC_PLLCfgTypeDef *pll)
{
  switch (pll->id)
  {
    case RCC_CK_PLL4 ... RCC_CK_PLL8:
      if (RCC_FG_GetGFG(pll) != 0)
      {
        return HAL_ERROR;
      }
      break;
    case RCC_CK_PLL2 ... RCC_CK_PLL3:
      if (RCC_GetPLL23(pll) != 0)
      {
        return HAL_ERROR;
      }
      break;
    default:
      return HAL_ERROR; // Invalid clock
  }

  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_SetPllCfg(RCC_PLLCfgTypeDef *pll)
{
  switch (pll->id)
  {
    case RCC_CK_PLL4 ... RCC_CK_PLL8:
      if (RCC_FG_SetGFG(pll) != 0)
      {
        return HAL_ERROR;
      }
      break;
    case RCC_CK_PLL2 ... RCC_CK_PLL3:
      if (RCC_SetPLL23(pll) != 0)
      {
        return HAL_ERROR;
      }
      break;
#ifdef CORE_CA35
    case RCC_CK_PLL1:
    {
      /* PLLTS16FFCLAFRAC2 setup order:
         - Set bypass (supported by PLL1 ?)
         - Disable postdiv (supported by PLL1 ?) then VCO
         - Select source
         - Configure PLL
         - Enable PLL if RCC_PLLSTATE_ON
         - Remove bypass if NOT RCC_PLLSTATE_BYPASS (supported by PLL1 ?)
       */
      if (HAL_RCC_Xable(RCC_CK_PLL1, 0) != HAL_OK)
      {
        return HAL_ERROR;
      }

      /* Select PLL1 source
         Reminder: MUXSEL5=>PLL1 */
      int src_idx;
      src_idx = RCC_FG_GetClockIdx(pll->source, RCC_Flexgen.ref_table, RCC_Flexgen.ref_size);
      if (src_idx == -1)
      {
        return HAL_ERROR;
      }
      uint32_t val;
      val = READ_REG(RCC->MUXSELCFGR) & ~(0x3 << 20); // Get current switch value + clear muxsel5
      WRITE_REG(RCC->MUXSELCFGR, val | (src_idx << 20));

      /* TODO: Configuration to be completed.
         Does PLL1 supports fractional ? */

      /* Enable PLL if RCC_PLLSTATE_ON */
      if (pll->state & RCC_PLLSTATE_ON)
        if (HAL_RCC_Xable(RCC_CK_PLL1, 1) != HAL_OK)
        {
          return HAL_ERROR;
        }
    }
    break;
#endif
    default:
      return HAL_ERROR; // Invalid clock
  }

  return HAL_OK;
}

/* Get clock config (status, source & div).
   Returns: HAL status */
HAL_StatusTypeDef HAL_RCC_GetClockCfg(RCC_ClkCfgTypeDef *clk)
{
  switch (clk->id)
  {

