STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
    /* Flexiclockgen outputs */
    case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
      /* Get source */
      if (RCC_FG_GetSource(clk->id, &clk->source) != 0)
      {
        return HAL_ERROR;
      }
      /* Get div */
      if (RCC_FG_GetDiv(clk->id, &clk->divvalue) != 0)
      {
        return HAL_ERROR;
      }
      /* Enabled ? */
      int enabled;
      if (RCC_FG_GetStatus(clk->id, &enabled) != 0)
      {
        return HAL_ERROR;
      }
      if (enabled)
      {
        clk->state = RCC_CLKSTATE_ON;
      }
      else
        clk->state = RCC_CLKSTATE_OFF;
      break;

    /* Flexiclockgen observation paths */
    case RCC_CK_OBS0 ... RCC_CK_OBS1:
      if (RCC_FG_GetObs(clk->id, &clk->source, &clk->divvalue) != 0)
      {
        return HAL_ERROR;
      }
      break;

    /* Bus clocks */
    case RCC_CK_ICN_APB1 ... RCC_CK_ICN_APBDBG:
      clk->source = HAL_RCC_GetSource(clk->id);
      clk->state = RCC_CLKSTATE_ON;
      {
        void *addr;
        if (clk->id < RCC_CK_ICN_APB4)
        {
          addr = (void *)&RCC->APB1DIVR + (clk->id - RCC_CK_ICN_APB1) * 4;
        }
        else
          addr = (void *) { &RCC->APB4DIVR + (clk->id - RCC_CK_ICN_APB4) * 4; }
                 /* Possible div values: 1, 2, 4, 8, or 16 */
                 clk->divvalue = 1 << READ_REGA(addr);
      }
      break;

    case RCC_CK_RTC:
      clk->source = HAL_RCC_GetSource(clk->id);
      if (READ_REG(RCC->BDCR) & (1 << 20))
      {
        clk->state = RCC_CLKSTATE_ON;
      }
      else
        clk->state = RCC_CLKSTATE_OFF;
      clk->divvalue = READ_REG(RCC->RTCDIVR) + 1;
      break;

    default:
      return HAL_ERROR;
  }

  return HAL_OK;
}

/* Set clock config (status, source & div).
   Returns: HAL status */
HAL_StatusTypeDef HAL_RCC_SetClockCfg(RCC_ClkCfgTypeDef *clk)
{
  /* Some params checks */
  assert_param(clk != NULL);
  assert_param(clk->id != RCC_CK_NONE);
  assert_param(clk->source != RCC_CK_NONE);
  assert_param(clk->state != RCC_CLKSTATE_UNDEF);

  /* TODO: Must add security to
     - set source then div
     - or div then source
     according to intermediate freq which should NOT be greater than target
     to avoid child IPs hangs */

  switch (clk->id)
  {

    /* Flexiclockgen outputs */
    case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
      /* Configure source */
      if (RCC_FG_SetSource(clk->id, clk->source) != 0)
      {
        return HAL_ERROR;
      }
      /* Configure div */
      if (RCC_FG_SetDiv(clk->id, clk->divvalue) != 0)
      {
        return HAL_ERROR;
      }
      /* Enable */
      if (RCC_FG_Xable(clk->id, 1) != 0)
      {
        return HAL_ERROR;
      }
      break;

    /* Flexiclockgen observation paths */
    case RCC_CK_OBS0 ... RCC_CK_OBS1:
      if (RCC_FG_SetObs(clk->id, clk->source, &clk->divvalue) != 0)
      {
        return HAL_ERROR;
      }
      break;

    /* Bus clocks */
    case RCC_CK_ICN_APB1 ... RCC_CK_ICN_APBDBG:
    {
      /* Check & convert 'divvalue' */
      uint32_t val;
      switch (clk->divvalue)
      {
        case 1:
          val = 0;
          break;
        case 2:
          val = 1;
          break;
        case 4:
          val = 2;
          break;
        case 8:
          val = 3;
          break;
        case 16:
          val = 4;
          break;
        default:
          return HAL_ERROR; // Invalid divider value
      }

      void *addr;
      if (clk->id < RCC_CK_ICN_APB4)
      {
        addr = (void *)&RCC->APB1DIVR + (clk->id - RCC_CK_ICN_APB1) * 4;
      }
      else
        addr = (void *) { &RCC->APB4DIVR + (clk->id - RCC_CK_ICN_APB4) * 4; }

               /* Configure switch & wait for completion */
               WRITE_REGA(addr, val);
      if (RCC_Wait(addr, 1 << 31, 1 << 31, CLOCKSWITCH_TIMEOUT_VALUE) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }
    }
    break;

    case RCC_CK_RTC:
      if (clk->divvalue == 0)
      {
        return HAL_ERROR;  // Invalid div value
      }
      if (clk->divvalue > 64)
      {
        return HAL_ERROR;  // Invalid div value
      }
      WRITE_REG(RCC->RTCDIVR, clk->divvalue - 1); // HSE divider
      /* BDCR->RTCSRC WARNING !
         This field can be written only one time after backup domain reset. */
      RCC_XableProtection(0); // Disable write protection
      uint32_t exp;
      switch (clk->source)
      {
        case RCC_CK_LSE:
          exp = 1;
          break;
        case RCC_CK_LSI:
          exp = 2;
          break;
        case RCC_CK_HSE:
          exp = 3;
          break;
        default:
          exp = 0;
          break; // No source
      }
      /* Modify BDCR & checks RTSRC properly changed */
      MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSRC, (exp << RCC_BDCR_RTCSRC_Pos));
      if ((READ_REG(RCC->BDCR) & RCC_BDCR_RTCSRC) != (exp << RCC_BDCR_RTCSRC_Pos))
      {
        RCC_XableProtection(1); // Reenable write protection
        return HAL_ERROR;
      }
      if (clk->state == RCC_CLKSTATE_ON)
      {
        SET_BIT(RCC->BDCR, RCC_BDCR_RTCCKEN);
      }
      else
        CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCCKEN);
      RCC_XableProtection(1); // Reenable write protection
      break;

    default:
      return HAL_ERROR;
  }

  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_SetCA35SSCfg(RCC_MuxCfgTypeDef *mux)
{
  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_GetCA35SSCfg(RCC_MuxCfgTypeDef *mux)
{
  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_SetBusClockCfg(RCC_ClkCfgTypeDef *clk)
{
  /* Handles the bus dividers, including LSMCUDIV */

  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_SetPeriphClockCfg(RCC_ClkCfgTypeDef *clk)
{
  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_GetBusClockCfg(RCC_ClkCfgTypeDef *clk)
{
  /* Handles the bus dividers, including LSMCUDIV */

  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_GetPeriphClockCfg(RCC_ClkCfgTypeDef *clk)
{
  return HAL_OK;
}

/* OBI split into two functions: one for LSE and one for HSE */
/**
  * @brief  Enables the HSE Clock Security System.
  * @note   If a failure is detected on the HSE:
  *         - The RCC generates a system reset (nreset). The flag HCSSRSTF is set in order to
  *           allow the application to identify the reset root cause.
  *         - A failure event is generated (rcc_hsecss_fail). This event is connected to the TAMP
  *           block, allowing the protection of backup registers and BKPSRAM.
  *
  * @note   HSECSSON can be activated even when the HSEON is set to ‘0’. The CSS on HSE will be
  *         enabled by the hardware when the HSE is enabled and ready, and HSECSSON is set to ‘1’.
  *
  * @note   The HSECSS is disabled when the HSE is disabled (i.e. when the system is STOP or
  *         STANDBY).
  *
  * @note   It is not possible to clear the bit HSECSSON by software.
  *
  * @note   The bit HSECSSON will be cleared by the hardware when a system reset occurs or when
            the system enters in STANDBY mode
  * @retval None
  */
void HAL_RCC_EnableCSS(uint16_t clk_id)
{
  switch (clk_id)
  {
    case RCC_CK_HSE:
      SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSECSSON);
      break;
    case RCC_CK_LSE:
      SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
      break;
    default:
      break; // Unsupported case
  }
}

