STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
void HAL_RCC_EnableHSECSS(void)
{
  SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSECSSON);
}

void HAL_RCC_EnableLSECSS(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Returns the SYSCLK frequency
  *
  * @note   The system frequency computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note     If SYSCLK source is CSI, function returns values based on CSI_VALUE(*)
  * @note     If SYSCLK source is HSI, function returns values based on HSI_VALUE(**)
  * @note     If SYSCLK source is HSE, function returns values based on HSE_VALUE(***)
  * @note     If SYSCLK source is PLL, function returns values based on CSI_VALUE(*),
  *           HSI_VALUE(**) or HSE_VALUE(***) multiplied/divided by the PLL factors.
  * @note     (*) CSI_VALUE is a constant defined in stm32mp1xx_hal_conf.h file (default value
  *               4 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (**) HSI_VALUE is a constant defined in stm32mp1xx_hal_conf.h file (default value
  *               64 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (***) HSE_VALUE is a constant defined in stm32mp1xx_hal_conf.h file (default value
  *                24 MHz), user has to ensure that HSE_VALUE is same as the real
  *                frequency of the crystal used. Otherwise, this function may
  *                have wrong result.
  *
  * @note   The result of this function could be not correct when using fractional
  *         value for HSE crystal.
  *
  * @note   This function can be used by the user application to compute the
  *         baud rate for the communication peripherals or configure other parameters.
  *
  * @note   Each time SYSCLK changes, this function must be called to update the
  *         right SYSCLK value. Otherwise, any configuration based on this function will be incorrect.
  *
  * @retval SYSCLK frequency
  */
uint32_t HAL_RCC_GetSysClockFreq(void)
{
  return HAL_RCC_GetFreq(RCC_CK_HSI);
}

HAL_StatusTypeDef HAL_RCC_GetOscCfg(RCC_OscCfgTypeDef *osc)
{
  assert_param(osc != NULL);
  assert_param(osc->id != RCC_CK_NONE);

  /* Cleaning some parameters */
  osc->calibrationvalue = 0;
  osc->divvalue = 0; // Used by CSI only
  osc->drivevalue = 0; // Used by LSE only

  switch (osc->id)
  {
    case  RCC_CK_LSI:
      if (READ_REG(RCC->BDCR) & RCC_BDCR_LSION)
      {
        osc->state = RCC_OSCSTATE_ON;
      }
      else
        osc->state = RCC_OSCSTATE_OFF;
      break;
    case RCC_CK_LSE:
    {
      uint32_t reg;
      reg = READ_REG(RCC->BDCR);
      if ((reg & RCC_BDCR_LSEON) == 0)
      {
        osc->state = RCC_OSCSTATE_OFF;
      }
      else if ((reg & RCC_BDCR_LSEBYP) == 0)
      {
        osc->state = RCC_OSCSTATE_ON;
      }
      else if ((reg & RCC_BDCR_LSEDIGBYP) == 0)
      {
        osc->state = RCC_OSCSTATE_BYPASS;
      }
      else
        osc->state = RCC_OSCSTATE_DIGBYPASS;
      osc->drivevalue = (reg >> 4) & 3;
    }
    break;
    case RCC_CK_CSI:
      if (READ_REG(RCC->D3DCR) & RCC_D3DCR_CSION)
      {
        osc->state = RCC_OSCSTATE_ON;
      }
      else
        osc->state = RCC_OSCSTATE_OFF;
      osc->calibrationvalue =
        (uint32_t)((READ_REG(RCC->CSICFGR) & RCC_CSICFGR_CSITRIM) >> RCC_CSICFGR_CSITRIM_Pos);
      break;
    case RCC_CK_HSE:
      if (READ_REG(RCC->OCENSETR) & RCC_OCENSETR_HSEBYP)
      {
        osc->state = RCC_OSCSTATE_BYPASS;
      }
      else if (READ_REG(RCC->OCENSETR) & RCC_OCENSETR_HSEON)
      {
        osc->state = RCC_OSCSTATE_ON;
      }
      else
        osc->state = RCC_OSCSTATE_OFF;
      break;
    case RCC_CK_HSI:
      if (READ_REG(RCC->OCENSETR) & RCC_OCENSETR_HSION)
      {
        osc->state = RCC_OSCSTATE_ON;
      }
      else
        osc->state = RCC_OSCSTATE_OFF;
      osc->calibrationvalue =
        (uint32_t)((READ_REG(RCC->HSICFGR) & RCC_HSICFGR_HSITRIM) >> RCC_HSICFGR_HSITRIM_Pos);
      break;
  }

  return HAL_OK;
}

/**
  * @brief  Returns the System Core frequency
  *
  * @note   The system frequency computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constants and the selected clock source
  * @retval System Core frequency
  */
uint32_t HAL_RCC_GetSystemCoreClockFreq(void)
{
// #ifdef CORE_CA35
  // return HAL_RCC_GetMPUSSFreq();
// #else // CORE_CM33
  // return HAL_RCC_GetMCUFreq();
// #endif
  return 12; // FCh: TODO
}

/* OBI: Split this function into GetBusClockFreq & GetPeriphClockFreq & GetPllClockFreq & GetOscClockFreq functions */
/* This function can then be removed */
/* Returns 'clk_id' frequency.
   Should we return 0 if disabled ??? */
uint32_t HAL_RCC_GetFreq(uint32_t clk_id)
{
  uint16_t src_id;
  uint32_t sfreq;
  uint32_t freq = 0;
  switch (clk_id)
  {
    /* Oscillators */
    case RCC_CK_HSE:
    case RCC_CK_HSE_KER:
      freq = HSE_VALUE;
      break;
    case RCC_CK_HSI:
    case RCC_CK_HSI_KER:
      freq = HSI_VALUE;
      break;
    case RCC_CK_LSE:
      freq = LSE_VALUE;
      break;
    case RCC_CK_LSI:
      freq = LSI_VALUE;
      break;
    case RCC_CK_CSI:
    case RCC_CK_CSI_KER:
      /* TODO: Missing 4 vs 16M support. CSI_VALUE should be 16M then */
      freq = CSI_VALUE;
      break;
    /* Flexgen: Muxsel outputs */
    case RCC_CK_PLL4REF ... RCC_CK_PLL3REF:
      RCC_FG_GetSource(clk_id, &src_id);
      freq = HAL_RCC_GetFreq(src_id);
      break;
    /* Flexgen: internal PLLs */
    case RCC_CK_PLL4 ... RCC_CK_PLL8:
    {
      RCC_PLLCfgTypeDef pll;
      pll.id = clk_id;
      RCC_FG_GetGFG(&pll);
      switch (clk_id)
      {
          /* In case of Emulator platform, PLL output clocks are forced. */
          /* PLL frequencies shall be defined in include 'stm32mp2xx_clocks.h' */
          /* in BSP/STM32MP257CXX_EMU directory */
#if defined (USE_STM32MP257CXX_EMU)
#ifdef PLL4_VALUE
        case RCC_CK_PLL4:
          sfreq = PLL4_VALUE;
          break;
#endif /* PLL4_VALUE */
#ifdef PLL5_VALUE
        case RCC_CK_PLL5:
          sfreq = PLL5_VALUE;
          break;
#endif /* PLL5_VALUE */
#ifdef PLL6_VALUE
        case RCC_CK_PLL6:
          sfreq = PLL6_VALUE;
          break;
#endif /* PLL6_VALUE */
#ifdef PLL7_VALUE
        case RCC_CK_PLL7:
          sfreq = PLL7_VALUE;
          break;
#endif /* PLL7_VALUE */
#ifdef PLL8_VALUE
        case RCC_CK_PLL8:
          sfreq = PLL8_VALUE;
          break;
#endif /* PLL8_VALUE */

