STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
#elif defined (USE_STM32MP257CXX_FPGA)
        /* In case of FPGA platform, definition of PLL output clocks are given */
        /* by documents Panther_FPGA_ASSY*.pdf delivered in netlist package :  */
        /* "PLL reference clock is not configurable: fixed at 32MHz for all PLLs input" */
        case RCC_CK_PLL4:
        case RCC_CK_PLL5:
        case RCC_CK_PLL6:
        case RCC_CK_PLL7:
        case RCC_CK_PLL8:
          /* "PLL VCO frequency = 32MHz * FBDIV / REFDIV" */
          sfreq = 32000000 * pll.fbdiv / pll.frefdiv;
          break;
#else
        case RCC_CK_PLL4:
        case RCC_CK_PLL5:
        case RCC_CK_PLL6:
        case RCC_CK_PLL7:
        case RCC_CK_PLL8:
          /* TO BE IMPLEMENTED */
          break;
#endif /* defined (USE_STM32MP257CXX_EMU) | defined (USE_STM32MP257CXX_FPGA) */

        default:
          sfreq = 0;
          break;
      }
      if (sfreq == 0)
      {
        src_id = pll.source;
        sfreq = HAL_RCC_GetFreq(src_id);
      }
      freq = sfreq / (pll.postdiv1 * pll.postdiv2);
    }
    break;
    /* Flexgen: Final div outputs */
    case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
    {
      uint32_t div;
      RCC_FG_GetSource(clk_id, &src_id);
      sfreq = HAL_RCC_GetFreq(src_id);
      RCC_FG_GetDiv(clk_id, &div);
      if (div != 0)
      {
        freq = sfreq / div;
      }
    }
    break;
    /* Bus clocks */
    case RCC_CK_ICN_APB1 ... RCC_CK_ICN_APBDBG:
    {
      RCC_ClkCfgTypeDef clk;
      clk.id = clk_id;
      HAL_RCC_GetClockCfg(&clk);
      sfreq = HAL_RCC_GetFreq(clk.source); // Get source freq
      if (clk.divvalue != 0)
      {
        freq = sfreq / clk.divvalue;
      }
    }
    break;
    /* Misc */
    case RCC_CK_RTC:
      src_id = HAL_RCC_GetSource(clk_id);
      sfreq = HAL_RCC_GetFreq(src_id);
      if (src_id == RCC_CK_HSE)
      {
        uint32_t div;
        div = (READ_REG(RCC->RTCDIVR) & 0x3f) + 1; // HSE divider
        freq = sfreq / div;
      }
      else
        freq = sfreq;
      break;
    default:
      break;
  };

  return freq;
}

uint32_t HAL_RCC_GetBusClockFreq(uint32_t clk_id)
{
  uint16_t src_id;
  uint32_t sfreq;
  uint32_t freq = 0;

  /* Add asserts here to limit request to bus clocks */

  switch (clk_id)
  {
    /* Bus clocks */
    case RCC_CK_ICN_APB1 ... RCC_CK_ICN_APBDBG:
    {
      RCC_ClkCfgTypeDef clk;
      clk.id = clk_id;
      HAL_RCC_GetClockCfg(&clk);
      sfreq = HAL_RCC_GetFreq(clk.source); // Get source freq
      if (clk.divvalue != 0)
      {
        freq = sfreq / clk.divvalue;
      }
    }
    break;
    default:
      break;
  };

  return freq;
}

uint32_t HAL_RCC_GetPeriphClockFreq(uint32_t clk_id)
{
  uint16_t src_id;
  uint32_t sfreq;
  uint32_t freq = 0;
  switch (clk_id)
  {

    /* Add asserts here to limit to flexgen 7 to 63 range */

    /* Flexgen: Final div outputs */
    case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
    {
      uint32_t div;
      RCC_FG_GetSource(clk_id, &src_id);
      sfreq = HAL_RCC_GetFreq(src_id);
      RCC_FG_GetDiv(clk_id, &div);
      if (div != 0)
      {
        freq = sfreq / div;
      }
    }
    break;
    default:
      break;
  };

  return freq;
}

uint32_t HAL_RCC_GetPllClockFreq(uint32_t clk_id)
{
  uint16_t src_id;
  uint32_t sfreq;
  uint32_t freq = 0;
  switch (clk_id)
  {

    /* Add asserts here to limit to Pll range */

    /* Flexgen: Muxsel outputs */
    case RCC_CK_PLL4REF ... RCC_CK_PLL3REF:
      RCC_FG_GetSource(clk_id, &src_id);
      freq = HAL_RCC_GetFreq(src_id);
      break;
    /* Flexgen: internal PLLs */
    case RCC_CK_PLL4 ... RCC_CK_PLL8:
    {
      RCC_PLLCfgTypeDef pll;
      pll.id = clk_id;
      RCC_FG_GetGFG(&pll);
      switch (clk_id)
      {
          /* In case of Emulator platform, PLL output clocks are forced. */
          /* PLL frequencies shall be defined in include 'stm32mp2xx_clocks.h' */
          /* in BSP/STM32MP257CXX_EMU directory */
#if defined (USE_STM32MP257CXX_EMU)
#ifdef PLL4_VALUE
        case RCC_CK_PLL4:
          sfreq = PLL4_VALUE;
          break;
#endif /* PLL4_VALUE */
#ifdef PLL5_VALUE
        case RCC_CK_PLL5:
          sfreq = PLL5_VALUE;
          break;
#endif /* PLL5_VALUE */
#ifdef PLL6_VALUE
        case RCC_CK_PLL6:
          sfreq = PLL6_VALUE;
          break;
#endif /* PLL6_VALUE */
#ifdef PLL7_VALUE
        case RCC_CK_PLL7:
          sfreq = PLL7_VALUE;
          break;
#endif /* PLL7_VALUE */
#ifdef PLL8_VALUE
        case RCC_CK_PLL8:
          sfreq = PLL8_VALUE;
          break;
#endif /* PLL8_VALUE */

#elif defined (USE_STM32MP257CXX_FPGA)
        /* In case of FPGA platform, definition of PLL output clocks are given */
        /* by documents Panther_FPGA_ASSY*.pdf delivered in netlist package :  */
        /* "PLL reference clock is not configurable: fixed at 32MHz for all PLLs input" */
        case RCC_CK_PLL4:
        case RCC_CK_PLL5:
        case RCC_CK_PLL6:
        case RCC_CK_PLL7:
        case RCC_CK_PLL8:
          /* "PLL VCO frequency = 32MHz * FBDIV / REFDIV" */
          sfreq = 32000000 * pll.fbdiv / pll.frefdiv;
          break;
#else
        case RCC_CK_PLL4:
        case RCC_CK_PLL5:
        case RCC_CK_PLL6:
        case RCC_CK_PLL7:
        case RCC_CK_PLL8:
          /* TO BE IMPLEMENTED */
          break;
#endif /* defined (USE_STM32MP257CXX_EMU) | defined (USE_STM32MP257CXX_FPGA) */

        default:
          sfreq = 0;
          break;
      }
      if (sfreq == 0)
      {
        src_id = pll.source;
        sfreq = HAL_RCC_GetFreq(src_id);
      }
      freq = sfreq / (pll.postdiv1 * pll.postdiv2);
    }
    break;
    default:
      break;
  };

  return freq;
}

uint32_t HAL_RCC_GetOscClockFreq(uint32_t clk_id)
{
  uint32_t freq = 0;

  /* Add asserts here to limit to osc range */

  switch (clk_id)
  {
    /* Oscillators */
    case RCC_CK_HSE:
    case RCC_CK_HSE_KER:
      freq = HSE_VALUE;
      break;
    case RCC_CK_HSI:
    case RCC_CK_HSI_KER:
      freq = HSI_VALUE;
      break;
    case RCC_CK_LSE:
      freq = LSE_VALUE;
      break;
    case RCC_CK_LSI:
      freq = LSI_VALUE;
      break;
    case RCC_CK_CSI:
    case RCC_CK_CSI_KER:
      /* TODO: Missing 4 vs 16M support. CSI_VALUE should be 16M then */
      freq = CSI_VALUE;
      break;
    default:
      break;
  };

  return freq;
}

uint32_t HAL_RCC_GetCA35SSFreq(void)
{
  return HAL_RCC_GetPllClockFreq(RCC_CK_PLL1);
}

uint32_t HAL_RCC_GetCM33SSFreq(void)
{
  return HAL_RCC_GetPllClockFreq(RCC_CK_PLL2); // OBI: TBC
}

uint32_t HAL_RCC_GetDDRFreq(void)
{
  return HAL_RCC_GetPllClockFreq(RCC_CK_PLL2);
}

uint32_t HAL_RCC_GetGPUFreq(void)
{
  return HAL_RCC_GetPllClockFreq(RCC_CK_PLL3);
}

/* Returns 'clk_id' measured frequency.
   This feature is available for the following clock types only:
   - flexgen input clocks
   - flexgen PLL input clocks
   - flexgen PLL output clocks
   - PLL1 to 3 ref clocks
   - flexgen final div output clocks
   Should we return 0 if disabled ??? */
uint32_t HAL_RCC_GetFreqM(uint32_t clk_id)  /* OBI: renamed to HAL_RCC_MeasureClockFreq, see next function */
{
  /* Selecting ref clock */
  /* TODO: This part must be revisited to select carefully the ref
           clock according to clock to measure */
  uint16_t ref_id;
  if (clk_id == RCC_CK_PLL4REF)
  {
    ref_id = RCC_CK_PLL5REF;
  }
  else
    ref_id = RCC_CK_PLL4REF;

  uint32_t freq;
  RCC_FG_GetMeasure(clk_id, ref_id, &freq);
  return freq;
}

