STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
uint32_t HAL_RCC_MeasureClockFreq(uint32_t clk_id)
{
  /* Selecting ref clock */
  /* TODO: This part must be revisited to select carefully the ref
           clock according to clock to measure */
  uint16_t ref_id;
  if (clk_id == RCC_CK_PLL4REF)
  {
    ref_id = RCC_CK_PLL5REF;
  }
  else
    ref_id = RCC_CK_PLL4REF;

  uint32_t freq;
  RCC_FG_GetMeasure(clk_id, ref_id, &freq);
  return freq;
}

/* Returns source clock ID or 0 for 'no source' or error */
uint16_t HAL_RCC_GetSource(uint32_t clk_id)
{
  uint16_t src_id = 0;
  switch (clk_id)
  {
    /* Flexgen: Muxsel outputs */
    case RCC_CK_PLL4REF ... RCC_CK_PLL3REF:
      RCC_FG_GetSource(clk_id, &src_id);
      break;
    /* Flexgen: internal PLLs */
    case RCC_CK_PLL4 ... RCC_CK_PLL8:
      /* Static connection to 'REF' */
      src_id = RCC_CK_PLL4REF + (clk_id - RCC_CK_PLL4);
      break;
    /* Flexgen: Final div outputs */
    case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
      RCC_FG_GetSource(clk_id, &src_id);
      break;
    /* Bus clocks */
    case RCC_CK_ICN_APB1 ... RCC_CK_ICN_APB3:
      src_id = RCC_CK_ICN_MCU;
      break;
    case RCC_CK_ICN_APB4 ... RCC_CK_ICN_APBDBG:
      src_id = RCC_CK_ICN_SDMMC;
      break;
    case RCC_CK_RTC:
      switch ((READ_REG(RCC->BDCR) >> 16) & 0x3)
      {
        case 1:
          src_id = RCC_CK_LSE;
          break;
        case 2:
          src_id = RCC_CK_LSI;
          break;
        case 3:
          src_id = RCC_CK_HSE;
          break;
        default: // No clock
          break;
      }
      break;
    default:
      break;
  };

  return src_id;
}

/* Returns 1 if enabled, 0 if disabled or error */
int HAL_RCC_IsEnabled(uint32_t clk_id)
{
  assert_param(clk_id != RCC_CK_NONE);
  assert_param(clk_id < RCC_CK_LAST);

  int enabled = 0;
  switch (clk_id)
  {
    /* Oscillators */
    case  RCC_CK_LSI:
      if (READ_REG(RCC->BDCR) & RCC_BDCR_LSION)
      {
        enabled = 1;
      }
      break;
    case RCC_CK_LSE:
      if (READ_REG(RCC->BDCR) & RCC_BDCR_LSEON)
      {
        enabled = 1;
      }
      break;
    case RCC_CK_CSI:
    case RCC_CK_CSI_KER:
      if (READ_REG(RCC->D3DCR) & RCC_D3DCR_CSION)
      {
        enabled = 1;
      }
      break;
    case RCC_CK_HSE:
    case RCC_CK_HSE_KER:
      if (READ_REG(RCC->OCENSETR) & RCC_OCENSETR_HSEON)
      {
        enabled = 1;
      }
      break;
    case RCC_CK_HSI:
    case RCC_CK_HSI_KER:
      if (READ_REG(RCC->OCENSETR) & RCC_OCENSETR_HSION)
      {
        enabled = 1;
      }
      break;
    /* PLLs */
    case RCC_CK_PLL4 ... RCC_CK_PLL8:
      RCC_FG_GetStatus(clk_id, &enabled);
      break;
    /* Flexgen div outputs */
    case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
      RCC_FG_GetStatus(clk_id, &enabled);
      break;
    /* Always enabled (no gating capability) */
    case RCC_CK_PLL4REF ... RCC_CK_PLL8REF:
    case RCC_CK_PLL1REF ... RCC_CK_PLL3REF:
    case RCC_CK_ICN_APB1 ... RCC_CK_ICN_APBDBG:
    case RCC_CK_I2S:
    case RCC_CK_SPDIF:
      enabled = 1;
      break;
  }

  return enabled;
}

/* OBI: what do we do with this function?
   Returns 1 if full clock tree is enabled.
   If a source is disabled returns 0. */
int HAL_RCC_IsRunning(uint32_t clk_id)
{
  assert_param(clk_id != RCC_CK_NONE);
  assert_param(clk_id < RCC_CK_LAST);

  /* Is source running ? */
  uint16_t src_id;
  src_id = HAL_RCC_GetSource(clk_id);
  if (src_id != RCC_CK_NONE)
  {
    if (!HAL_RCC_IsRunning(src_id))
    {
      return 0;
    }
  }

  /* Source path is running.
     What about local status ? */
  if (HAL_RCC_IsEnabled(clk_id))
  {
    return 1;
  }
  return 0;
}

/* Reroute 'src1_id' child clocks to use 'src2_id' instead.
   Note: Rerouting is done only if clock is enabled.
   Note: If new freq is higher than current, divider is modified to not go above.
   Returns: 0=OK, -1=ERROR */
int HAL_RCC_RerouteChilds(uint16_t src1_id, uint16_t src2_id)
{
  assert_param(src1_id != RCC_CK_NONE);
  assert_param(src1_id < RCC_CK_LAST);
  assert_param(src2_id != RCC_CK_NONE);
  assert_param(src2_id < RCC_CK_LAST);

  /* TODO: Should we check there if new source is enabled ? */
  /* TODO: Should be reroute even if clock disabled ? */

  uint32_t src1_freq, src2_freq;
  src1_freq = HAL_RCC_GetFreq(src1_id);
  src2_freq = HAL_RCC_GetFreq(src2_id);

  uint16_t clk_id;
  for (clk_id = 1; clk_id < RCC_CK_LAST; clk_id++)
  {
    /* Only crossbar outputs supported so far */
    if ((clk_id < RCC_Flexgen.fdiv_first) || (clk_id > RCC_Flexgen.fdiv_last))
    {
      continue;
    }

    /* TODO: Does this makes sense for final div outputs ? */
    if ((clk_id == src1_id) || (clk_id == src2_id))
    {
      continue;
    }
    if (HAL_RCC_GetSource(clk_id) != src1_id)
    {
      continue;
    }

    if (!HAL_RCC_IsEnabled(clk_id))
    {
      continue;  // Disabled. Ignoring...
    }

    /* 'clk_id' is using 'src1_id'. Changing its source */
    switch (clk_id)
    {
      /* Flexgen: Muxsel outputs */
      case RCC_CK_PLL4REF ... RCC_CK_PLL3REF:
        if (RCC_FG_SetSource(clk_id, src2_id) != 0)
        {
          return -1;
        }
        break;
      /* Flexgen: Final div outputs */
      case RCC_CK_ICN_MCU ... RCC_CK_CPU1EXT2F:
      {
        uint32_t div;
        RCC_FG_GetDiv(clk_id, &div);
        uint32_t cur_freq, new_freq;
        cur_freq = src1_freq / div;
        new_freq = src2_freq / div;
        if (new_freq > cur_freq)
        {
          div = src2_freq / cur_freq;
          if (src2_freq % cur_freq)
          {
            div++;
          }
          RCC_FG_SetDiv(clk_id, div);
        }
      }
      if (RCC_FG_SetSource(clk_id, src2_id) != 0)
      {
        return -1;
      }
      break;
      /* Bus clocks */
      /* TODO: No sense. Following clocks have static parent */
      case RCC_CK_ICN_APB1 ... RCC_CK_ICN_APBDBG:
      {
        RCC_ClkCfgTypeDef clk;
        clk.id = clk_id;
        clk.source = src2_id;
        if (HAL_RCC_SetClockCfg(&clk) != HAL_OK)
        {
          return -1;
        }
      }
      break;
      default:
        return -1; // Error
    }
  }
  return 0;
}

/**
  * @brief This function handles the general (rcc_cpu1_it/rcc_cpu2_it)
  *        and processor wakeup (rcc_cpu1_wkup_it/rcc_cpu2_wkup_it) RCC interrupts
  * @retval None
  */
void HAL_RCC_IRQHandler(void)
{
  void *reg;
#ifdef CORE_CA35
  reg = (void *)&RCC->C1CIFCLRR;
#else // M33
  reg = (void *)&RCC->C2CIFCLRR;
#endif

