STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
  uint32_t flags;
  flags = READ_REGA(reg);
#if 0 /* Is this rather a processing to be implemented in HAL_RCC_Callback(flags)
         when flags&RCC_IT_LSECSS=RCC_IT_LSECSS ? */
  if (__HAL_RCC_GET_IT(RCC_IT_LSECSS) != RESET)
  {
    SET_BIT(flags, RCC_IT_LSECSS);

    /* Enable write access to Backup domain */
    SET_BIT(PWR->CR1, PWR_CR1_DBP);

    /* Clear LSECSSON bit */
    HAL_RCCEx_DisableLSECSS();
    /* Clear LSEON bit */
    CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);

    /* Clear the LSECSSF bit */
    __HAL_RCC_CLEAR_IT(RCC_IT_LSECSS);
  }
#endif

  /* Process all RCC flags */
  if (flags)
  {
    /* Clear the RCC interrupt bits */
    __HAL_RCC_CLEAR_IT(flags);

    /* RCC interrupt user callback */
    HAL_RCC_Callback(flags);
  }
}

/**
  * @brief  RCC global interrupt callback
  * @param  Flags: It contains the flags which were set during the RCC_IRQHandler
  *                before cleaning them
  * @retval None
  */
__weak void HAL_RCC_Callback(uint32_t Flags)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_Callback could be implemented in the user file
  */
}

__weak void HAL_CSS_Callback(uint32_t Flags)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_Callback could be implemented in the user file
  */
}

/**
  * @brief This function handles the RCC Wake up interrupt (rcc_mcu_wkup_irq/rcc_mpu_wkup_irq)
  * @retval None
  */
void HAL_RCC_WAKEUP_IRQHandler(void)
{
  /* Check whether RCC WKUP interrupt flag is set */
  if (__HAL_RCC_GET_IT(RCC_IT_WKUP) != RESET)
  {
    /* Clear RCC WKUP interrupt flag bit */
    __HAL_RCC_CLEAR_IT(RCC_IT_WKUP);

    /* RCC WKUP interrupt user callback */
    HAL_RCC_WAKEUP_Callback();
  }
}

void HAL_HSIMON_IRQHandler(void)
{
}

__weak void HAL_HSIMON_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_WAKEUP_Callback could be implemented in the user file
  */
}

/**
  * @brief  RCC WAKEUP interrupt callback
  * @retval None
  */
__weak void HAL_RCC_WAKEUP_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_WAKEUP_Callback could be implemented in the user file
  */
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/***** MP2 RIF SPECIFIC : TO BE MERGED TO DIFFERENT "defgroup" HERE ABOVE *****/
/** @defgroup RCC_RIF_HAL RCC_RIF
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/* Read a register in same device to be sure that previous write operation */
/* into RCC_RxSEMCR is completed (without breaking processor pipeline).    */
__STATIC_INLINE HAL_StatusTypeDef WAIT_MUTEX_WRITTEN_IN_RCC_RxSEMCR(uint32_t LocalResIndex)
{
  /* Therefore, we take this opportunity to check (by reading register RCC_RxCIDCFGR[i]) */
  /* that a dynamic CID filtering is effectively configured for present local resource. */
  if ((READ_REG(RCC->R[LocalResIndex].CIDCFGR) & RCC_LOCALRES_ATTR_CID_TYPE_Msk) == RCC_LOCALRES_CID_TYPE_DYNAMIC)
  {
    return HAL_OK;
  }
  else
    return HAL_ERROR;
}

/* Exported macros -----------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_HAL_RIF_Exported_Functions RCC HAL RIF Exported Functions
  * @{
  */

/** @defgroup RCC_HAL_EF_RIF RCC HAL RIF
  * @brief RCC HAL RIF module driver
  * @{
  */

/* On secure Cortex core only : */
#if defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Configure Security/Privilege/CID Access Filtering of one RCC Local Resource
  *         Lock this configuration if requested
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @param  LocalResAttributes Value set by an "OR" operation between :
  *         - one or none Lock configuration argument
  *           @arg RCC_LOCALRES_LOCKED
  *         - one or none Security filtering argument
  *           @arg RCC_LOCALRES_SEC
  *           @arg RCC_LOCALRES_NOSEC
  *         - one or none Privilege filtering argument
  *           @arg RCC_LOCALRES_PRIV
  *           @arg RCC_LOCALRES_NOPRIV
  *         - none or one Static CID filtering argument among
  *           @arg RCC_LOCALRES_CID_STATIC_0
  *           @arg RCC_LOCALRES_CID_STATIC_1
  *           @arg RCC_LOCALRES_CID_STATIC_2
  *           @arg RCC_LOCALRES_CID_STATIC_3
  *           @arg RCC_LOCALRES_CID_STATIC_4
  *           @arg RCC_LOCALRES_CID_STATIC_5
  *           @arg RCC_LOCALRES_CID_STATIC_6
  *           @arg RCC_LOCALRES_CID_STATIC_7
  *           or else a constant Dynamic CID filtering argument among
  *           @arg RCC_LOCALRES_CID_DYNAMIC_NONE
  *           @arg RCC_LOCALRES_CID_DYNAMIC_ALL
  *           or else an "OR" combination of Dynamic CID filtering arguments among
  *           @arg RCC_LOCALRES_CID_DYNAMIC_0
  *           @arg RCC_LOCALRES_CID_DYNAMIC_1
  *           @arg RCC_LOCALRES_CID_DYNAMIC_2
  *           @arg RCC_LOCALRES_CID_DYNAMIC_3
  *           @arg RCC_LOCALRES_CID_DYNAMIC_4
  *           @arg RCC_LOCALRES_CID_DYNAMIC_5
  *           @arg RCC_LOCALRES_CID_DYNAMIC_6
  *           @arg RCC_LOCALRES_CID_DYNAMIC_7
  *
  * @note If Lock configuration argument is not provided,
  *       Security/Privilege/CID filtering configuration is not locked.
  *       If Security filtering configuration argument is not provided,
  *       no security filtering configuration is applied.
  *       If Privilege filtering configuration argument is not provided,
  *       no privilege filtering configuration is applied.
  *       If neither static CID filtering argument,
  *       nor dynamic CID filtering argument is provided,
  *       CID filtering is disabled.
  * @retval HAL Status in {HAL_OK; HAL_ERROR}.
  */
HAL_StatusTypeDef HAL_RCC_ConfigAttributes(uint32_t LocalResIndex, uint32_t LocalResAttributes)
{
  /* Initialize HAL status */
  HAL_StatusTypeDef hal_status = HAL_BUSY;

  /* Split LOCK/PRIV/SEC/CID attributes */
  uint32_t priv_attr = LocalResAttributes & RCC_LOCALRES_ATTR_PRIV_Msk;
  uint32_t lock_attr = LocalResAttributes & RCC_LOCALRES_ATTR_LOCK_Msk;
  uint32_t sec_attr  = LocalResAttributes & RCC_LOCALRES_ATTR_SEC_Msk;
  uint32_t cid_attr  = LocalResAttributes & (RCC_LOCALRES_ATTR_CID_TYPE_Msk |
                                             RCC_LOCALRES_ATTR_STATIC_CID_Msk |
                                             RCC_LOCALRES_ATTR_DYNAMIC_CID_Msk);

  /* Check input parameters : */
  /* - valid range of LocalResIndex */
  assert_param(IS_LOCALRES_INDEX(LocalResIndex));
  /* - valid value of PRIV attribute */
  assert_param(IS_PRIV_ATTRIBUTE(priv_attr));
  /* - valid value of LOCK attribute */
  assert_param(IS_LOCK_ATTRIBUTE(lock_attr));
  /* - valid value of SEC attribute */
  assert_param(IS_SEC_ATTRIBUTE(sec_attr));
  /* - valid values of CID type, Static CID and Dynamic CID attributes */
  assert_param(IS_CID_ATTRIBUTE(cid_attr));

  /* Take into account that TDCID is allowed to set any configuration */
  /* that is to say modifying security and privilege filtering */
  /* even if current CID filtering prevents to do it. */
#if defined(CORE_CA35)
  LL_RCC_SetLocalResSCid(LocalResIndex, RCC_LOCALRES_CID_STATIC_1);
#endif /* defined(CORE_CA35) */
#if defined(CORE_CM33)
  LL_RCC_SetLocalResSCid(LocalResIndex, RCC_LOCALRES_CID_STATIC_2);
#endif /* defined(CORE_CM33) */

