STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_valid.c
  /* Check input parameter : LocalResIndex in valid range */
  assert_param(IS_LOCALRES_INDEX(LocalResIndex));

  /* For local resource : */
  /* - check semaphore initial state */
  /*   and set output status accordingly */
  /*   <=> if semaphore has not been taken by : */
  /*       - CID1 in A35 case, */
#if defined(CORE_CA35)
  if (LL_RCC_GetLocalResSem(LocalResIndex) != RCC_LOCALRES_TAKEN_SEMCID1)
#endif /* defined(CORE_CA35) */
    /*       - CID2 in M33 case, */
#if defined(CORE_CM33)
    if (LL_RCC_GetLocalResSem(LocalResIndex) != RCC_LOCALRES_TAKEN_SEMCID2)
#endif /* defined(CORE_CM33) */
    {
      /*       then output error status */
      return HAL_ERROR;
    }
  /* - release semaphore */
  LL_RCC_ReleaseLocalResSem(LocalResIndex);
  /* - once mutex has been updated in target register, */
  WAIT_MUTEX_WRITTEN_IN_RCC_RxSEMCR(LocalResIndex);
  /*   check semaphore has been released */
  /*   and set output status accordingly */
  /*   <=> if semaphore has not been released by : */
  /*       - CID1 in A35 case, */
#if defined(CORE_CA35)
  if (LL_RCC_GetLocalResSem(LocalResIndex) != RCC_LOCALRES_RELEASED_SEMCID1)
#endif /* defined(CORE_CA35) */
    /*       - CID2 in M33 case, */
#if defined(CORE_CM33)
    if (LL_RCC_GetLocalResSem(LocalResIndex) != RCC_LOCALRES_RELEASED_SEMCID2)
#endif /* defined(CORE_CM33) */
    {
      /*       then output error status */
      return HAL_ERROR;
    }
  /* return HAL status */
  if (hal_status == HAL_BUSY)
  {
    hal_status = HAL_OK;
  }
  return hal_status;
}
#endif // 191021
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
/******************************************************************************/

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
